{
  "workSlug": "the-gods-below-state-street",
  "reviews": [
    {
      "personaId": "fan-001-siobhan",
      "rating": 5,
      "text": "Oh, this is lovely. The opening line alone -- 'The thing about gods is that they tip like shit' -- is doing so much work, setting up the whole tonal register in nine words. Gaiman's fingerprints are everywhere in the matter-of-fact mythology, but the Abercrombie cynicism keeps it from getting precious. Yevgeny explaining divinity like plumbing is perfect dark whimsy. And Rae's choice at the end genuinely moved me. Keeping the knowing because it's hers, even though it costs her -- that's the kind of earned sentiment that only lands when the rest of the story hasn't been sentimental at all.",
      "date": "2025-08-12",
      "helpfulCount": 47
    },
    {
      "personaId": "fan-004-jaylen",
      "rating": 4,
      "text": "I'd hand this to a student who says they don't like fantasy. It reads fast, the voice is sharp and funny, and the gods feel real because they're pathetic in the way real people are pathetic. The Bridget-Yevgeny dynamic is great -- you can feel The Blade Itself's morally grey ensemble in how nobody's entirely trustworthy. Strong ending. The cat detail at the very end is the kind of thing that makes a story feel lived-in.",
      "date": "2025-10-03",
      "helpfulCount": 22
    },
    {
      "personaId": "fan-005-karin",
      "rating": 4,
      "text": "The atmosphere is excellent -- Chicago's freight tunnels as divine territory is an inspired choice, and the story earns its setting rather than merely using it as backdrop. The prose maintains a controlled, sardonic register throughout that serves the Gaiman-Abercrombie blend well. I particularly admired the passage about belief-as-plumbing and the tunnel descent where each god's territory has a distinct sensory signature.\n\nMy reservation is pacing: the middle section where Bridget explains the con runs slightly long. The story is strongest in its opening and its climax. Still, the final choice -- keeping knowledge despite its cost -- is the right ending for this particular narrator.",
      "date": "2025-12-19",
      "helpfulCount": 38
    },
    {
      "personaId": "fan-002-omar",
      "rating": 4,
      "text": "Solid piece. The dialogue between Bridget and Yevgeny has real Abercrombie energy -- 'You are the worst co-conspirator I have ever worked with, Veles. And I have worked with Loki' made me laugh out loud. Rae's cynicism feels earned, not performed. But the plot is thin -- it's basically one reveal and one choice. For something invoking The Blade Itself, I wanted more political complexity, more factions playing angles. The south side gods and Tlaloc's people are mentioned but never shown. Still, the voice carries it.",
      "date": "2026-01-08",
      "helpfulCount": 31
    },
    {
      "personaId": "fan-008-esme",
      "rating": 4,
      "text": "What this story understands about diasporic mythology is that the gods don't just travel -- they thin. They become habits. Yevgeny's one old woman in Wicker Park who lights candles because her mother taught her is a detail that hit me personally. My grandmother does the same. The freight tunnels as a space where these forgotten deities coexist and compete is a genuinely smart structural metaphor for immigrant Chicago. The Gaiman influence is clear in making all of this feel ordinary rather than wondrous, but Abercrombie's moral greyness complicates it beautifully -- Bridget isn't wrong that the system works, she's just wrong about what that justifies.",
      "date": "2025-09-27",
      "helpfulCount": 56
    },
    {
      "personaId": "fan-003-valentina",
      "rating": 3,
      "text": "The Gaiman elements are well-executed: the matter-of-fact divine, the immigrant gods fading with assimilation, the bartender-as-everywoman drawn into mythological conflict. The Abercrombie contribution is most visible in the dialogue and in the refusal to let any character occupy a morally clean position. The American Gods DNA is unmistakable, perhaps too much so -- the belief-as-currency conceit is handled competently but doesn't add to what Gaiman already explored. What saves the piece from being derivative is the ending. Rae's refusal isn't heroic defiance; it's stubborn ownership. That distinction matters, and the story earns it.",
      "date": "2026-02-06",
      "helpfulCount": 43
    },
    {
      "personaId": "fan-006-diego",
      "rating": 3,
      "text": "Tlaloc's people are mentioned exactly once, as a geopolitical chess piece. The Mexican gods exist here only as a strategic threat to the European faction, never as characters with their own interiority or perspective. The story is aware of this -- the 'careful disrespect' in Bridget's phrasing is noted by the narrator -- but awareness is not the same as correction. Otherwise the prose is strong and the tunnel descent is genuinely atmospheric. The Norn humming in the alcove is a nice touch.",
      "date": "2025-11-15",
      "helpfulCount": 29
    },
    {
      "personaId": "fan-007-natsuki",
      "rating": 3,
      "text": "Good voice, thin worldbuilding. The belief-as-resource system never gets specific enough -- how much belief sustains a god? What happens at zero? The 'deep thing' has no rules at all. Atmospheric but structurally loose. Dialogue carries the piece.",
      "date": "2026-01-30",
      "helpfulCount": 8
    }
  ]
}
