{
  "workSlug": "the-woman-who-borrowed",
  "reviews": [
    {
      "personaId": "mys-003-keiko",
      "rating": 5,
      "text": "As a psychologist myself, I am accustomed to wincing through fictional portrayals of therapy. This one made me sit up straight. The ethical trap Dr. Riordan finds herself in — unable to warn her daughter without violating confidentiality — is rendered with such precision that I felt it physically. The line about 'the architecture of my own profession' holding her inside while the threat moves freely is exactly right. And the ambiguity is genuine. I have sat across from patients whose presentations were textbook and whose stories were invented, and I have sat across from patients whose truths sounded like performances. This story understands that the clinical gaze cannot always distinguish between the two, and it has the courage not to pretend otherwise. The Dublin setting is atmospheric without being decorative. Niamh's final speech about building herself from borrowed materials stayed with me for days.",
      "date": "2025-08-14",
      "helpfulCount": 58
    },
    {
      "personaId": "mys-006-lynn",
      "rating": 4,
      "text": "What a quietly devastating piece of writing. The therapist-narrator's voice is so controlled, so measured, and you can feel the panic underneath it like water rising in a basement. The moment she learns her daughter has befriended Niamh — that dinner scene on Wexford Street where the restaurant contracts around her — is one of the most effective suspense scenes I have read in years, and it contains no violence at all, just a name spoken across a table. I found myself unable to decide whether Niamh is a predator or a survivor, and the story respects the reader enough to leave that unresolved. The Dublin rain and Georgian architecture become part of the mood in a way that felt organic rather than staged. I will be thinking about the green armchair for a long time.",
      "date": "2025-09-29",
      "helpfulCount": 42
    },
    {
      "personaId": "mys-008-grace",
      "rating": 4,
      "text": "This got under my skin. I kept going back and forth on Niamh — is she dangerous? is she just broken? The part where Aisling says 'she gets me' and the narrator feels it like something thrown was so real. Any mother would feel that. The ending left me unsettled in a way I wasn't expecting. I wanted resolution and the story basically said no, you don't get that, and somehow that felt more honest than a twist would have.",
      "date": "2025-11-03",
      "helpfulCount": 15
    },
    {
      "personaId": "mys-001-siobhan",
      "rating": 4,
      "text": "The Dublin is right, which matters to me. Merrion Square, Rathmines, Camden Street, the Shelbourne — these are real places rendered with the kind of familiarity that comes from walking them daily, not from Google Maps. The story understands how small Dublin's professional circles are and uses that smallness as a mechanism of dread. The Garda in me wanted someone to investigate something, to pull records, to intervene — but the story is smarter than that. The therapist's inability to act is the point. Her professional ethics become a cage, and watching her pace inside it is more suspenseful than any chase scene. The ambiguity about Niamh is well-handled, though I found myself leaning toward the predator reading. That wine glass detail at the Shelbourne was chilling.",
      "date": "2025-12-17",
      "helpfulCount": 33
    },
    {
      "personaId": "mys-007-tomasz",
      "rating": 4,
      "text": "The philosophical core of this story is a genuine ethical puzzle, not a dressed-up plot device. Is identity something you possess or something you construct? If a person has no original self, is borrowing from others theft or creation? The narrator explicitly frames this as 'the Highsmith reading' versus 'the French reading,' which is a bold structural choice — laying the two possible interpretations side by side and refusing to adjudicate. It works because the story has already embedded enough evidence for both that neither feels like a straw man. The question it leaves you with — whether predation and survival can be the same act — is the kind of thing Highsmith herself circled around in the Ripley novels without ever answering. I admired this piece's nerve in doing the same.",
      "date": "2026-01-05",
      "helpfulCount": 27
    },
    {
      "personaId": "mys-011-noel",
      "rating": 4,
      "text": "Good story. Kept me reading. The therapist's voice is convincing and the Dublin details are spot on. Would have liked a clearer ending — I finished it and sat there thinking 'but what happened?' which I suppose is the point but left me a bit cold.",
      "date": "2026-01-22",
      "helpfulCount": 4
    },
    {
      "personaId": "mys-002-harold",
      "rating": 3,
      "text": "Competently written and atmospherically sound, but this is, at bottom, a story in which nothing happens. A woman copies another woman's mannerisms. A therapist worries. The rain falls on Dublin. One waits for a revelation or a confrontation that never arrives, and the narrative instead offers us the intellectual proposition that ambiguity is more truthful than resolution. This may well be the case, philosophically speaking, but it does not make for a satisfying mystery. The prose is controlled and occasionally striking — the image of the green armchair as a vessel for stories is well-crafted — but control is not the same as propulsion. I found myself wanting the machinery of plot that the genre promises and this piece withholds.",
      "date": "2025-10-11",
      "helpfulCount": 19
    },
    {
      "personaId": "mys-010-valentina",
      "rating": 3,
      "text": "There is a sharp class reading buried in this story that the narrator herself seems only half-aware of. Niamh moves from a flatshare in Rathmines to the Docklands tech world by absorbing the social markers of wealthier women — their hair, their wine, their ease. The story frames this as pathology or survival, but it could equally be read as aspiration under capitalism, the way class mobility in Dublin requires performing a self you were not born into. The Fiona Brennan material is the strongest: a woman whose 'curated aesthetic' conceals its own hollowness, undone by someone who curates better. The narrator's anxiety about her daughter feels real but also possessive in ways the text does not fully interrogate. Who is the real subject here — Niamh's borrowing or Claire's need to control?",
      "date": "2026-02-01",
      "helpfulCount": 36
    },
    {
      "personaId": "mys-005-desmond",
      "rating": 3,
      "text": "The prose is careful and the Dublin atmosphere is rendered with genuine authority — the Georgian light, the rain, the particular social compression of the city's professional class. These are not complaints. But I confess I find the central conceit underpowered. A woman imitates other women. A therapist observes and frets. The story asks us to treat this as suspense, but the stakes remain abstract: nobody is harmed, nothing is stolen that can be named, and the narrator's inability to determine whether her patient is predator or survivor becomes, across seventeen minutes of reading, less an ethical puzzle than a rhetorical exercise. The 'Highsmith reading' versus 'French reading' passage is too neat by half — it names its own influences as though scoring an essay rather than telling a story. Craft without urgency.",
      "date": "2025-07-30",
      "helpfulCount": 22
    }
  ]
}
