{
  "workSlug": "somnographic-index-of-disappearances",
  "reviews": [
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-034-sarah",
      "rating": 3,
      "text": "Structurally interesting, emotionally overwrought. The first half is superb — the clinical entries accumulating, the 14.2 Hz anomaly recurring with slight morphological variation, the bureaucratic memo that reveals institutional complicity through sheer banality. This is precise, controlled work. But around Entry 011 the prose begins to consume itself. The recursive metaphors (building-as-document-as-city-as-frequency-as-women) pile up until they collapse under their own weight. Entry 014 is nearly a full page of unbroken spiral that sacrifices the tension the earlier restraint had built. The story is more powerful when Dr. Araya's grief is compressed into a single clinical note — 'I am no longer requesting equipment calibration' — than when it erupts into paragraphs of self-aware anguish about the inadequacy of clinical language. The piece knows this, which makes the excess harder to forgive. Appendix C partially redeems the back half. The truncated final line is the right ending.",
      "date": "2025-08-03",
      "helpfulCount": 47
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-012-gerald",
      "rating": 4,
      "text": "A formally ambitious piece that largely earns its ambitions. The clinical index as narrative container is not novel — one thinks of Nabokov's commentary or Danielewski's house — but the execution is remarkably disciplined. The erosion of clinical register is the real achievement: compare Entry 001's measured somnographic notation with the recursive anguish of Entry 014, and you observe a complete structural arc without a single conventional scene. The inter-office memoranda are shrewd, establishing the institutional machinery that makes disappearance administratively possible. Where it falters is in the later entries, where the metaphorical architecture — building-as-document, document-as-building — becomes insistent. The truncated final line is earned. Appendix C is devastating and structurally necessary. The aggregate summary table with its last row is the sort of formal gesture I wish more contemporary writers attempted.",
      "date": "2025-09-22",
      "helpfulCount": 38
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-068-priya",
      "rating": 4,
      "text": "What makes this work is that the clinical format isn't a gimmick — it's the argument. The bureaucratic structure is itself the mechanism of disappearance. Each \"file transferred to inactive\" is a woman being erased in real time by the very document that claims to record her existence. Dr. Araya's growing awareness of her own complicity — that she has been \"writing their names in a format that makes their disappearance look like paperwork\" — is devastating precisely because she never stops writing in that format. She can't. The most affecting passage for me was Rosalinda bringing her two-year-old to the intake appointment, and then the quiet addendum in Appendix C: \"The two-year-old's name is Emilia. I am writing the child's name here because someone should.\" That line broke something in me.",
      "date": "2025-09-22",
      "helpfulCount": 31
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-047-adaeze",
      "rating": 5,
      "text": "What this story understands about systemic violence is that it operates through paperwork. The disappeared women are not erased by dramatic acts — they are erased by 'file transferred to inactive,' by a health authority asking for 'a clean index,' by a pharmacy that replaces a missing clerk the same afternoon. The specificity matters: these are maquiladora workers, domestic workers, night janitors. The economy that employs them is the same system that makes their disappearance unremarkable. Dr. Araya's gradual collapse from clinician to witness to participant is devastating precisely because she keeps writing — the document becomes both memorial and indictment, and the reader becomes complicit simply by reading an index that was never meant to be distributed. I will be thinking about Graciela Molina's answer for a long time: 'I don't think it matters if I am afraid.'",
      "date": "2026-02-11",
      "helpfulCount": 24
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-095-yuki",
      "rating": 3,
      "text": "The image of electrodes growing out of the scalp \"like root structures\" is extraordinary. The sub-harmonics halving and halving toward a silence the body hears as architecture — that is a genuinely original conceit. But the piece over-explains its own metaphor. By Entry 012 the narrator is explicitly telling us the document is the building is the city is the women, collapsing distances the reader should be left to cross alone. The strongest entries are the early ones, where the clinical distance does the work. Graciela Molina saying \"I don't think it matters if I am afraid\" — that is the whole story in one sentence. The rest is elaboration.",
      "date": "2026-02-11",
      "helpfulCount": 22
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-055-james",
      "rating": 3,
      "text": "The sense of place is real. You feel the maquiladoras, the green plastic chairs, the government offices that process people into nothing. That part lands. But the form fights you. By the eighth or ninth entry with the same 14.2 Hz frequency and the same copper smell, I started skimming, and I don't think you should have to fight a story this hard to stay in it. The clinical language trick is effective early on but it wears thin. The best moment is the pharmacy clerk — the narrator realizing she sold this woman cough medicine and didn't recognize her. That's a real human detail, not a structural exercise. More of that, less of the waveform mysticism, and this would be a different story.",
      "date": "2025-11-14",
      "helpfulCount": 18
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-001-emmanuel",
      "rating": 4,
      "text": "This broke something in me. The accumulation of those entries — each woman arriving with the same dream, the same copper smell, and then just... gone. 'File transferred to inactive.' That phrase will haunt me. The moment with Rosalinda bringing her two-year-old to the appointment, and the clinician writing the child's name in Appendix C 'because someone should' — that is emotional honesty at its most devastating. The prose does get overwrought in places, particularly Entry 012 where the sentences spiral into self-consuming recursion that loses clarity. But Dr. Araya's voice is utterly convincing, the way her clinical detachment cracks entry by entry until the document itself becomes a confession. Not an easy read, but an honest one.",
      "date": "2025-11-14",
      "helpfulCount": 15
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-081-rosa",
      "rating": 5,
      "text": "I had to set this down twice and come back. The form — a clinical annual report — is so precise and so restrained that when it begins to crack, when Dr. Araya starts writing in first person in those italicized sections, the effect is almost unbearable. This is a story about what happens when the language we use to document suffering becomes part of the suffering itself. The disappeared women of the border cities deserve every kind of memorial, and this one — a sleep clinic's case index that refuses to be \"clean\" — is unlike any I have encountered. What stays with me is Appendix C, where Dr. Araya goes back and adds Yolanda and Dolores, her first two patients, the ones she failed earliest. That retroactive act of naming. That refusal to let the document close around its own omissions. I am an old woman and I have read a great deal and this will stay with me for a long time.",
      "date": "2025-08-05",
      "helpfulCount": 12
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-023-mei",
      "rating": 5,
      "text": "I had to put my phone down after reading Appendix C. The entry for Sofia Reyes — 'She came from nowhere that I documented and returned to nowhere that I documented and the space between those two nowheres is the space where the investigation would be if there were an investigation' — I read that three times and each time it hurt differently. This story does something I have never encountered before: it makes bureaucratic formatting feel like a scream. The way the italicized personal notes keep bleeding through the clinical structure, like water finding cracks in a wall. Extraordinary.",
      "date": "2026-01-08",
      "helpfulCount": 8
    },
    {
      "workSlug": "somnographic-index-of-disappearances",
      "personaId": "lit-fic-072-david",
      "rating": 4,
      "text": "This is the real thing. The numbered-entry structure could so easily become a parlor trick but it earns its form — the accumulation IS the horror, the bureaucratic repetition IS the violence. Entry 015, where the unnamed woman is taken from the waiting room in fourteen seconds and the narrator just writes a note about it, is one of the most ruthless things I've read this year. The italicized confessional passages risk being too on-the-nose, and a couple of the later entries lean hard into the building-as-metaphor in ways that get repetitive. But that final summary table — \"Names I remember without checking the file: All of them\" — that's a genuine knockout. I wanted to be annoyed by this story and couldn't be.",
      "date": "2026-01-08",
      "helpfulCount": 6
    }
  ]
}