{
  "workSlug": "mouth-full-of-rivers",
  "reviews": [
    {
      "personaId": "mgr-002-nkechi",
      "rating": 5,
      "text": "This is the story I have been waiting for on this platform. The abiku child who carries the dead like silt in a river — that is not a metaphor borrowed from Okri, that is Okri's cosmology taken seriously and made to work in a story about maternal grief that could only come from someone who has read Morrison closely. Bisola's refusal to let go, her decision to be 'a fist around this life,' gave me the same chest-tightness I felt reading Sethe's chapters in Beloved. And the compound — that face-me-I-face-you with its salt patterns and its sweating walls — is both a Lagos compound I recognize from childhood visits and a spirit-house from The Famished Road. The exorcism scene with seven women is earned because every sentence before it has been building the pressure. Mama Joke seeing the shadows arrive before the child is one of those details I will not forget.",
      "date": "2025-09-18",
      "helpfulCount": 62
    },
    {
      "personaId": "mgr-003-rohan",
      "rating": 5,
      "text": "That moment when the child opens her mouth and what comes out is literally a river — not a metaphor, not a simile, an actual sound of water heard up and down the street — I had to put my phone down. And then Bisola kneels and just says 'they cannot live in my child,' quiet and firm, not begging, not performing, just telling the dead how it's going to be. Incredible scene. The whole danfo section made me feel the Lagos heat.",
      "date": "2026-01-22",
      "helpfulCount": 14
    },
    {
      "personaId": "mgr-001-valentina",
      "rating": 4,
      "text": "The fusion of Okri and Morrison is handled with intelligence here. The Okri thread is clear in the spirit-child cosmology and the road-as-threshold — the passage about Lagos traffic as 'not a condition but a theology' has the casual philosophical sweep that Okri does best. The Morrison thread lives in Bisola's body: the counting of breaths, the way she holds the child too tightly and the child's protest is 'so ordinary' it breaks her open. That is Morrison's method, the devastation delivered through the mundane. Where I hesitate is the pacing of the middle section. The cataloguing of Adunni's partial disappearances — the transparent hand, the feet sinking into asphalt — is vivid but slightly repetitive. The story finds its true power in the collective exorcism, which manages to be both Morrison's communal reckoning and Okri's spirit-world negotiation simultaneously. A strong piece.",
      "date": "2025-12-04",
      "helpfulCount": 44
    },
    {
      "personaId": "mgr-005-terrence",
      "rating": 4,
      "text": "I am always suspicious of stories that promise an ending and then deliver it too neatly, but this one earns its resolution. The child grows. The dead stay in the walls where they belong. It sounds simple but it arrives with the full weight of four thousand words of accumulated dread. What I appreciated most is that Baba Akin does not fix anything — he simply says 'the women must come,' and the women come, and the doing is theirs. That is Morrison's Beloved ending reimagined for a Lagos compound, and it works. The opening about the dead remembering through their mouths is the strongest paragraph in the piece.",
      "date": "2025-10-30",
      "helpfulCount": 29
    },
    {
      "personaId": "mgr-004-ingrid",
      "rating": 4,
      "text": "The prose rhythm here is doing something genuinely interesting — the long, accretive sentences that carry subclauses the way the child carries the dead, building pressure through accumulation rather than acceleration. This is Okri's spiral more than Morrison's incantation, though Morrison surfaces powerfully in the final pages when Bisola kneels and speaks to her daughter. The sentence about breathing being 'not a communion but simply breathing, the ordinary miracle of air' is precise without being precious. I question whether Mrs. Adebayo's characterization — reality increasing its resolution near her — adds enough or is merely decorative. But the structural decision to mirror the three deaths with the three-part exorcism is sound.",
      "date": "2026-02-11",
      "helpfulCount": 37
    },
    {
      "personaId": "mgr-006-saoirse",
      "rating": 4,
      "text": "The compound as a character — sweating, breathing, absorbing — operates differently from the house in Beloved and the road in The Famished Road but draws clearly on both. Where Morrison's 124 Bluestone repels the living, and Okri's road consumes travelers, this compound does something subtler: it stores. It is an archive of bodies, a concrete memory palace whose salt patterns are literally the handwriting of the dead. The spatial argument is that architecture in postcolonial Lagos is never merely material — it is always also spiritual infrastructure, built with blood and ash and river water. The face-me-I-face-you layout, where rooms face each other across a courtyard, becomes a metaphor for the living and dead regarding one another across the threshold of the compound itself.",
      "date": "2025-08-29",
      "helpfulCount": 51
    },
    {
      "personaId": "mgr-007-diana",
      "rating": 3,
      "text": "Competent and at times moving, but I have read enough Okri to know when someone is wearing his coat rather than their own. The spirit-child premise is The Famished Road's central conceit transposed almost directly. The road-as-theology passage is good writing but it is Okri's observation in new clothes. Where the story asserts its own identity is in the Morrison material — the exorcism scene, the women gathering, Bisola's quiet command. That final section is genuinely powerful. But it takes too long to arrive there, and the middle sections catalogue wonders at the expense of character. Bisola is vivid; the other women are sketches. Baba Akin is a type, not a person.",
      "date": "2026-02-15",
      "helpfulCount": 43
    },
    {
      "personaId": "mgr-008-fumiko",
      "rating": 3,
      "text": "There is too much here. The story accumulates spirits and wonders and voices and the effect is exhausting rather than enchanting. I wanted it to trust its quieter moments — Bisola counting breaths, the child's ordinary protest when held too tightly, the mangoes tasting of a dead mother's room. Those are the story's real magic, and they are buried under the louder supernatural events. The ending, when the child finally smells only of herself, is exactly the kind of restrained moment I wish the whole story had built toward with more patience.",
      "date": "2025-11-08",
      "helpfulCount": 22
    },
    {
      "personaId": "mgr-010-greg",
      "rating": 3,
      "text": "Not bad. Better than most magical realism I read on here. The Lagos setting is convincing and the mother's grief is real. But the spirit-child thing is pure Okri and the women-gathering-to-exorcise is pure Morrison and I kept waiting for the story to do something those two haven't already done. The danfo slogans were a nice touch. 'God Is Able' painted on the side of a bus that may or may not arrive — that's the kind of detail that earns its place.",
      "date": "2025-07-26",
      "helpfulCount": 8
    }
  ]
}
