{
  "genre": "gothic-fiction",
  "generatedDate": "2026-02-21",
  "combinations": [
    {
      "id": "goth-new-gothic-contemporary-001",
      "subgenre": "new-gothic-contemporary",
      "authorA": "Shirley Jackson",
      "authorB": "Silvia Moreno-Garcia",
      "workX": "The Haunting of Hill House",
      "workY": "Mexican Gothic",
      "fromAuthorA": ["claustrophobic interiority where the house thinks and the inhabitant doubts her own perception", "sentences that circle back on themselves, trapping the reader in the narrator's spiral", "loneliness as a structural vulnerability — the house finds the crack and presses"],
      "fromAuthorB": ["colonial architecture as living organism — the building digests its residents", "lush, sensory prose where beauty and nausea share a sentence", "the outsider heroine who refuses to be consumed, whose refusal is the plot"],
      "fromWorkX": ["a house that is fundamentally wrong in ways geometry cannot explain", "the slow dissolution of a rational mind under sustained atmospheric pressure", "the final question of whether the haunting was ever external"],
      "fromWorkY": ["mycological horror — the house as organism, its residents as nutrients", "the family secret that is also a biological process", "the colonial estate built on indigenous suffering, now rotting from within"],
      "targetWordCount": 5600,
      "readingTimeMinutes": 22,
      "themes": "A content moderator for a social media platform moves into a smart home that learns her habits, her fears, her search history. Jackson's psychological entrapment meets Moreno-Garcia's vision of architecture that feeds. The gothic of algorithmic intimacy — the house that knows you better than you know yourself, and the question of what it's optimizing for."
    },
    {
      "id": "goth-new-gothic-contemporary-002",
      "subgenre": "new-gothic-contemporary",
      "authorA": "Edgar Allan Poe",
      "authorB": "Mariana Enríquez",
      "workX": "The Fall of the House of Usher",
      "workY": "Our Share of Night",
      "fromAuthorA": ["rhythmic, incantatory prose that builds dread through accumulation rather than surprise", "the sympathetic narrator drawn into someone else's disintegration", "architecture as psyche — the crack in the wall is the crack in the mind"],
      "fromAuthorB": ["political violence embedded in the supernatural so deeply they become the same thing", "class horror — the rich as literal predators, their wealth a form of consumption", "the child who inherits a monstrous system and must decide whether to wield or destroy it"],
      "fromWorkX": ["the ancient family collapsing under the weight of its own history", "the twin — the double — the self split and watching itself die", "the house that falls when the bloodline ends, because they were never separate"],
      "fromWorkY": ["occult power as political metaphor — who feeds, who is fed upon", "the father trying to shield his son from an inheritance that is also a sentence", "Argentina's disappeared reappearing in forms worse than death"],
      "targetWordCount": 6200,
      "readingTimeMinutes": 25,
      "themes": "A tech billionaire's family compound in the Pacific Northwest begins exhibiting structural failures that mirror the family's internal dissolution. Poe's architectural psychodrama meets Enríquez's vision of wealth as predation. The contemporary gothic of dynastic money — the house of Usher reimagined as a startup founder whose legacy is a building that will not stop growing."
    },
    {
      "id": "goth-new-gothic-contemporary-003",
      "subgenre": "new-gothic-contemporary",
      "authorA": "Mary Shelley",
      "authorB": "Carlos Ruiz Zafón",
      "workX": "Frankenstein",
      "workY": "The Angel's Game",
      "fromAuthorA": ["the horror of creation and the creator's refusal to take responsibility", "the creature's eloquence — monstrosity that speaks more beautifully than its maker", "epistolary framing that distances the reader from horrors too direct to face"],
      "fromAuthorB": ["the city as labyrinth where architecture holds memory and intent", "baroque, romantic prose that treats books as living entities", "the sinister patron whose generosity is a form of ownership"],
      "fromWorkX": ["a being assembled from parts that should not cohere, but does — and suffers for it", "the Arctic pursuit — creator and creation locked in mutual destruction", "the question of what is owed to the thing you made"],
      "fromWorkY": ["the writer consumed by the work that was commissioned for unknown purposes", "Barcelona's Gothic Quarter as a geography of dread and literary ambition", "the manuscript that writes back — the creation that has its own agenda"],
      "targetWordCount": 7400,
      "readingTimeMinutes": 30,
      "themes": "A ghostwriter hired to produce a memoir for an anonymous client discovers the AI tool she's been given to assist her is generating passages she didn't prompt, about events she hasn't researched, in a voice she recognizes as her own from years ago. Shelley's horror of creation meets Zafón's literary Gothic of the authored self. The contemporary Frankenstein: not a body stitched together, but a voice."
    },
    {
      "id": "goth-gothic-romance-001",
      "subgenre": "gothic-romance",
      "authorA": "Daphne du Maurier",
      "authorB": "Emily Brontë",
      "workX": "Rebecca",
      "workY": "Wuthering Heights",
      "fromAuthorA": ["the unnamed heroine overshadowed by a predecessor she can never equal", "houses that are characters — Manderley as presence, judge, and trap", "romantic dread — desire and fear occupying the same breath"],
      "fromAuthorB": ["elemental, storm-force passion that destroys everyone it touches", "the moors as emotional landscape — barren, exposed, inescapable", "love that does not redeem but consumes, and the consumed do not want rescue"],
      "fromWorkX": ["the first wife as ghost — present in every object, every room, every servant's glance", "the husband whose devotion is indistinguishable from control", "the fire that resolves nothing because the haunting was never in the house"],
      "fromWorkY": ["love that transcends death in ways that are horrifying rather than comforting", "the window — the ghost at the window — begging to be let in across decades", "class violence and romantic violence as the same force"],
      "targetWordCount": 6800,
      "readingTimeMinutes": 27,
      "themes": "A woman marries a widower and moves into his clifftop house in Cornwall, where the previous wife's belongings have not been removed — they've been rearranged, daily, by someone. Du Maurier's shadow-wife dread meets Brontë's elemental possessiveness. A gothic romance where the rival is not dead but not alive in any way the living can address, and the husband's love is the least safe room in the house."
    },
    {
      "id": "goth-gothic-romance-002",
      "subgenre": "gothic-romance",
      "authorA": "Charlotte Brontë",
      "authorB": "Angela Carter",
      "workX": "Villette",
      "workY": "The Bloody Chamber",
      "fromAuthorA": ["the plain woman's fierce interiority — desire that burns but is never permitted to blaze", "the foreign setting as emotional exile, where the heroine is illegible to everyone", "restraint as a form of violence done to the self"],
      "fromAuthorB": ["fairy-tale structures stripped to their erotic and violent cores", "lush, jewel-encrusted prose where every surface drips with symbolic intent", "the heroine who discovers that the chamber she was forbidden to enter contains the truth about her husband and also about herself"],
      "fromWorkX": ["the teacher in a foreign school who falls in love with someone she cannot read", "loneliness so profound it generates hallucinations — the nun in the garden", "the buried letter — information concealed from the reader until the emotional cost is maximum"],
      "fromWorkY": ["the new bride in the castle discovering the fates of her predecessors", "desire as the mechanism of entrapment — wanting the person who will destroy you", "the mother's intervention — the one who rides in armed, not with love but with a weapon"],
      "targetWordCount": 5200,
      "readingTimeMinutes": 21,
      "themes": "A literature professor accepts a visiting position at a remote Italian villa-turned-academy, where the director's courtship is impeccable and his private library is locked. Brontë's starved longing meets Carter's erotic Gothic. The romance of the forbidden room: she knows she should not open it, she knows what she will find, and neither knowledge can compete with the need to see."
    },
    {
      "id": "goth-gothic-romance-003",
      "subgenre": "gothic-romance",
      "authorA": "Silvia Moreno-Garcia",
      "authorB": "Edgar Allan Poe",
      "workX": "The Daughter of Doctor Moreau",
      "workY": "Ligeia",
      "fromAuthorA": ["postcolonial settings where romance cannot be separated from power imbalance", "heroines who are simultaneously insider and outsider in their own homes", "the gothic of the hacienda — tropical decay, colonial guilt, biological horror"],
      "fromAuthorB": ["the dead beloved who refuses to stay dead, whose return is an act of will beyond the grave", "obsessive, hypnotic prose rhythms that mirror the narrator's fixation", "beauty as a form of horror — the woman so beautiful she becomes supernatural"],
      "fromWorkX": ["the isolated estate where scientific experimentation and family life are the same project", "the father whose love is also an experiment", "hybrid identity — belonging fully to neither world, claimed by both"],
      "fromWorkY": ["the second wife who is slowly replaced by the first", "the will that conquers death — love or possession, the story refuses to distinguish", "the dark-haired woman whose eyes hold knowledge that the living should not possess"],
      "targetWordCount": 4500,
      "readingTimeMinutes": 18,
      "themes": "A botanist on a research fellowship at a crumbling plantation in Yucatán falls in love with the estate's heir, whose first wife died in the greenhouse under circumstances the orchids seem to remember. Moreno-Garcia's colonial-tropical Gothic meets Poe's obsessive resurrection. A romance where the rival is not a ghost but a process — something growing in the hothouse that wears a familiar face."
    },
    {
      "id": "goth-queer-gothic-001",
      "subgenre": "queer-gothic",
      "authorA": "Sarah Waters",
      "authorB": "Edgar Allan Poe",
      "workX": "The Little Stranger",
      "workY": "The Masque of the Red Death",
      "fromAuthorA": ["queer desire coded into Victorian architecture — the servant's corridor, the locked room, the glance that means everything", "Dickensian social machinery where class determines who gets to want and who must suppress", "unreliable narration driven by desire the narrator cannot acknowledge"],
      "fromAuthorB": ["aristocratic decadence pursued to the point of self-destruction", "the sealed space — the attempt to lock out death by locking in pleasure", "color and spectacle as structural metaphor — each room a stage of dread"],
      "fromWorkX": ["the great house in decline — the family that cannot afford to keep what it cannot bear to lose", "the outsider whose fascination with the family is indistinguishable from desire to possess", "class resentment as poltergeist — the violence of wanting what you were never meant to have"],
      "fromWorkY": ["the masquerade — identity concealed behind elaborate performance", "death that enters despite every precaution, every wall, every lock", "the final room — the one you must eventually enter, where the reckoning waits"],
      "targetWordCount": 6500,
      "readingTimeMinutes": 26,
      "themes": "A restoration architect hired to save a Gilded Age mansion discovers that her growing obsession with the house is entangled with her attraction to the reclusive owner — a woman whose family sealed off the east wing after a masquerade ball in 1923 that no one who attended will discuss. Waters' queer coding within architecture meets Poe's sealed-room dread. The closet as literal architecture: rooms bricked shut to contain what happened there."
    },
    {
      "id": "goth-queer-gothic-002",
      "subgenre": "queer-gothic",
      "authorA": "Angela Carter",
      "authorB": "Emily Brontë",
      "workX": "The Magic Toyshop",
      "workY": "Wuthering Heights",
      "fromAuthorA": ["feminist reimagining of domestic captivity — the uncle's house as cage, the puppet theater as metaphor for control", "baroque, sensuous prose that makes oppression beautiful and beauty suspect", "desire as rebellion — the body's refusal to obey the patriarch's script"],
      "fromAuthorB": ["love that violates every social boundary and cannot be contained by any institution", "the wild child — Heathcliff, raised inside but never domesticated", "nature as emotional force — wind, rain, heath as extensions of ungovernable feeling"],
      "fromWorkX": ["the authoritarian household ruled by a craftsman who builds perfect, obedient things", "the puppet show — performance compelled by someone else's hand", "the swan — the moment the heroine destroys the mechanism of her own captivity"],
      "fromWorkY": ["two people who are the same person, split by the world into separate bodies", "the return — the one who was sent away coming back changed and dangerous", "love that the living world has no room for, that can only exist outside social structure"],
      "targetWordCount": 5900,
      "readingTimeMinutes": 24,
      "themes": "Two women raised as sisters in a taxidermist's household discover that their bond — which the household calls devotion and the town calls unnatural — is the only living thing in a house of preserved, posed, glassy-eyed perfection. Carter's feminist Gothic of the controlling craftsman meets Brontë's love-as-weather. The queer gothic of the specimen case: to be catalogued is to be killed and kept forever."
    },
    {
      "id": "goth-queer-gothic-003",
      "subgenre": "queer-gothic",
      "authorA": "Daphne du Maurier",
      "authorB": "Tanarive Due",
      "workX": "My Cousin Rachel",
      "workY": "The Good House",
      "fromAuthorA": ["romantic suspicion — the beloved who may be a poisoner, the desire that survives the doubt", "the narrator who cannot trust their own feelings because desire corrupts perception", "Cornwall as gothic landscape — cliffs, rain, isolation, the sea as judgment"],
      "fromAuthorB": ["ancestral hauntings specific to Black American experience — the old house holds what history did to the family", "the matriarchal legacy — power passed between women, feared by the community", "the good house that is not good, the family home that is the source of the horror"],
      "fromWorkX": ["the cousin whose charm is either genuine or lethal — the story refuses to resolve the ambiguity", "inheritance as motive — the estate that someone must die for someone else to keep", "the tisane, the herbal remedy, the cup of something that may be medicine or murder"],
      "fromWorkY": ["the house with a history the family remembers in fragments and the town remembers whole", "returning home as an act of reopening — old griefs, old doors, old bargains", "the ancestor whose deal still binds the living"],
      "targetWordCount": 7800,
      "readingTimeMinutes": 31,
      "themes": "A woman returns to her grandmother's house on the Georgia coast to settle the estate and encounters the neighbor who once loved the grandmother — or who the grandmother once loved — and whose continued devotion to the property is either tender or proprietary. Du Maurier's romantic suspicion meets Due's ancestral Gothic. A queer gothic where the haunting is not the desire itself but the decades of its concealment, and the house holds what two women could not say to each other while the town was listening."
    },
    {
      "id": "goth-classic-victorian-gothic-002",
      "subgenre": "classic-victorian-gothic",
      "authorA": "Emily Brontë",
      "authorB": "Mary Shelley",
      "workX": "Wuthering Heights",
      "workY": "Frankenstein",
      "fromAuthorA": ["passion that transcends death and social order, destructive in every direction", "the moors — open, exposed, elemental — as the only landscape vast enough for the emotion", "nested narration — the story told through intermediaries, each layer adding distortion"],
      "fromAuthorB": ["the creature's eloquence — the monster that speaks more movingly than its maker", "creation as transgression against the natural order", "the frame narrative of the explorer in a place no human was meant to reach"],
      "fromWorkX": ["Heathcliff — the foundling whose origin is a void, whose rage fills it", "the ghost at the window, begging across years to be let in", "two houses, two families, two generations destroyed by a single obsession"],
      "fromWorkY": ["the creature demanding a companion — the unbearable loneliness of being the only one of your kind", "the Arctic pursuit — creator and creation chasing each other to the end of the world", "what the creator owes the thing they made, and the violence of refusal"],
      "targetWordCount": 8600,
      "readingTimeMinutes": 34,
      "themes": "A naturalist in 1840s Yorkshire investigates reports of a figure on the moors — not a ghost but something assembled, something made, something that speaks in the voice of a woman dead thirty years. Brontë's elemental passion meets Shelley's horror of creation. A Victorian gothic where love refuses to stay buried not because the soul persists but because someone rebuilt the body, and the rebuilt thing remembers everything the original felt."
    },
    {
      "id": "goth-classic-victorian-gothic-003",
      "subgenre": "classic-victorian-gothic",
      "authorA": "Edgar Allan Poe",
      "authorB": "Daphne du Maurier",
      "workX": "The Cask of Amontillado",
      "workY": "Rebecca",
      "fromAuthorA": ["the confessional narrator whose remorse is indistinguishable from pride", "the catacomb — descent into underground spaces as descent into obsession", "revenge as architecture — the wall built brick by brick while the victim watches"],
      "fromAuthorB": ["the predecessor who dominates from beyond the grave", "the house as character, repository of judgment, and engine of narrative", "the servant who serves the dead mistress more faithfully than the living one"],
      "fromWorkX": ["the thousand injuries borne in silence, the insult that finally demands action", "the carnival — public festivity masking private murder", "entombment — the living sealed in with their knowledge, the perpetrator sealed out with his satisfaction"],
      "fromWorkY": ["Mrs. Danvers — the keeper of the shrine, more wife to Rebecca than the husband ever was", "the second wife who can never measure up and slowly stops trying", "the revelation that the first marriage was monstrous, which should free the second wife but doesn't"],
      "targetWordCount": 3800,
      "readingTimeMinutes": 15,
      "themes": "A wine merchant inherits a vineyard estate in southern France and discovers that the previous owner's cellar contains a walled-off section that the housekeeper insists must remain sealed — not for structural reasons but out of loyalty to the dead. Poe's architecture of revenge meets du Maurier's shrine to the predecessor. A compact gothic about the terror of inheritance: what the dead built to last, and the living cannot bring themselves to open."
    },
    {
      "id": "goth-postcolonial-gothic-002",
      "subgenre": "postcolonial-gothic",
      "authorA": "Silvia Moreno-Garcia",
      "authorB": "Tanarive Due",
      "workX": "Mexican Gothic",
      "workY": "Ghost Summer",
      "fromAuthorA": ["the colonial estate as organism — the hacienda that digests its inhabitants", "the glamorous outsider heroine who refuses to be passive", "eugenics, mycology, and family legacy as interlocking horrors"],
      "fromAuthorB": ["Black American hauntings where the ghost is history itself", "summer as the season when the buried return — heat forcing things to the surface", "communities that know what happened but have agreed not to speak of it"],
      "fromWorkX": ["the English family transplanted to Mexico, their manor an alien imposition on the landscape", "the mushroom — the fungal network connecting house, family, and soil in a system of mutual consumption", "the bride brought into the family to serve a biological purpose disguised as marriage"],
      "fromWorkY": ["the summer visit to the ancestral place where the children learn what the adults won't teach", "the body of water that holds what the town put there", "the ghost story that is also a history lesson the school system deleted"],
      "targetWordCount": 5400,
      "readingTimeMinutes": 22,
      "themes": "A graduate student researching plantation agriculture in the Caribbean arrives at a sugar estate now converted to a boutique hotel, where the cane fields have been replanted as a heritage attraction and the old processing buildings have been preserved as decor. Moreno-Garcia's colonial biology meets Due's community-of-silence Gothic. The postcolonial gothic of the heritage site: the plantation that has been repurposed but not reckoned with, where the soil remembers what the brochure omits."
    },
    {
      "id": "goth-southern-gothic-002",
      "subgenre": "southern-gothic",
      "authorA": "Edgar Allan Poe",
      "authorB": "Tanarive Due",
      "workX": "The Tell-Tale Heart",
      "workY": "The Between",
      "fromAuthorA": ["the narrator who insists on their sanity while demonstrating their madness", "guilt as sensory hallucination — the sound that will not stop, that only the guilty can hear", "rhythmic, accelerating prose that mimics the heartbeat of dread"],
      "fromAuthorB": ["the Black protagonist navigating a world where supernatural threat and racial threat are indistinguishable", "the between-space — neither alive nor dead, neither safe nor doomed", "the near-death experience that never fully ends, the rescue that was incomplete"],
      "fromWorkX": ["the beating heart beneath the floorboards — the crime that announces itself", "the old man's eye — the single detail that becomes the justification for everything", "the police visit — authority sitting in the room with the evidence, the murderer performing normalcy"],
      "fromWorkY": ["a man who should have died and didn't, haunted by the death that still claims him", "the threatening letters — messages from an unknown source that know too much", "the dream that is not a dream but a place, and the place is catching up"],
      "targetWordCount": 4200,
      "readingTimeMinutes": 17,
      "themes": "A Black county coroner in rural Alabama keeps hearing a sound from beneath the evidence room floor — a rhythmic thumping that began the night he ruled a death accidental that the family insists was murder. Poe's guilt-as-percussion meets Due's racial-supernatural Gothic. A southern gothic where the tell-tale heart belongs to someone whose death the system is designed to dismiss, and the man who signed the paperwork cannot stop hearing it."
    },
    {
      "id": "goth-southern-gothic-003",
      "subgenre": "southern-gothic",
      "authorA": "Mary Shelley",
      "authorB": "Flannery O'Connor",
      "workX": "Frankenstein",
      "workY": "Wise Blood",
      "fromAuthorA": ["the creator's horror at their own creation — the thing made that should not have been made", "eloquent monstrosity — the creature who articulates its suffering better than its maker can", "the pursuit across wastelands — creator and creation bound in mutual destruction"],
      "fromAuthorB": ["the Christ-haunted South where redemption is violent and uninvited", "grotesque characters who embody theological truths they cannot articulate", "darkly comic prose where the joke and the horror land simultaneously"],
      "fromWorkX": ["the assembled being — parts from different sources, alive but not whole", "the demand for a companion, the unbearable isolation of being singular", "fire and ice as the twin endings the creature can choose"],
      "fromWorkY": ["the self-appointed prophet driven by a faith he's trying to destroy", "the car as coffin, as pulpit, as the only church that will have him", "the grotesque act of devotion that repels everyone including God"],
      "targetWordCount": 4800,
      "readingTimeMinutes": 19,
      "themes": "A backwoods Alabama preacher builds a congregation around a body he found in the swamp — preserved, intact, and beautiful in a way that makes people weep when they see it. He calls it a sign. The county wants it removed. Shelley's horror of the beautiful corpse meets O'Connor's grotesque faith. A southern gothic about the thing that shouldn't be worshipped but is, and the man who made it sacred without understanding what he was doing."
    },
    {
      "id": "goth-suburban-domestic-gothic-002",
      "subgenre": "suburban-domestic-gothic",
      "authorA": "Daphne du Maurier",
      "authorB": "Angela Carter",
      "workX": "Don't Look Now",
      "workY": "The Company of Wolves",
      "fromAuthorA": ["grief-distorted perception — the bereaved parent who sees the dead child everywhere", "foreign settings where the protagonist is linguistically and culturally isolated", "the warning that comes too late or is misread because the grieving mind translates everything into hope"],
      "fromAuthorB": ["the fairy tale stripped to its erotic and violent skeleton", "the wolf who is also the lover — the predator encountered on the path, welcomed into the bed", "the grandmother's house reimagined as a space of female power, not female vulnerability"],
      "fromWorkX": ["the red coat — the flash of color that the parent chases through Venice's labyrinth", "the psychic's warning that is accurate but misunderstood", "the final reveal — the small figure in red that is not what the father believed"],
      "fromWorkY": ["the girl who walks into the forest knowing what waits there", "the consummation that is also a transformation — desire as the mechanism of becoming", "the grandmother's bones — what remains after the wolf has finished, what the girl must reckon with"],
      "targetWordCount": 3400,
      "readingTimeMinutes": 14,
      "themes": "A recently widowed woman in a Connecticut suburb keeps seeing a figure in her daughter's red raincoat at the edge of the woods behind the development — but her daughter is at school, and the coat is in the closet. Du Maurier's grief-vision meets Carter's fairy-tale predation. The suburban domestic gothic of the tree line: the forest that the development was carved from, the path the children are told not to take, and the figure that is not a child but wears a child's shape."
    }
  ]
}
