{
  "genre": "literary-fiction",
  "generatedDate": "2026-02-21",
  "combinations": [
    {
      "id": "lf-bildungsroman-001",
      "subgenre": "bildungsroman-coming-of-age",
      "authorA": "James Joyce",
      "authorB": "Chimamanda Ngozi Adichie",
      "workX": "A Portrait of the Artist as a Young Man",
      "workY": "Purple Hibiscus",
      "fromAuthorA": ["stream of consciousness developing with the protagonist's maturity", "linguistic invention — prose that grows more complex as the character does", "the artist's awakening as rebellion against family, church, and nation"],
      "fromAuthorB": ["precise, luminous realism grounded in cultural specificity", "warmth laced with political edge — domestic life as political terrain", "the child's perspective on adult violence and hypocrisy"],
      "fromWorkX": ["the young artist rejecting every institution that shaped them", "language itself as the medium of liberation — finding one's own voice", "the epiphany as structural unit — moments of sudden, devastating clarity"],
      "fromWorkY": ["a patriarch's religious fanaticism distorting family love", "the child learning to see the father as both protector and threat", "Nigeria and Ireland as parallel postcolonial crucibles"],
      "targetWordCount": 6200,
      "readingTimeMinutes": 25,
      "themes": "Joyce's linguistic self-invention meets Adichie's precise political realism. A coming-of-age story where the protagonist's language literally changes as they grow — beginning in a parent's idiom and ending in their own. Joyce brings the formal ambition; Adichie brings the insistence that growing up is never only personal but always also political."
    },
    {
      "id": "lf-bildungsroman-002",
      "subgenre": "bildungsroman-coming-of-age",
      "authorA": "Toni Morrison",
      "authorB": "Denis Johnson",
      "workX": "The Bluest Eye",
      "workY": "Jesus' Son",
      "fromAuthorA": ["lyrical, incantatory prose with mythic resonance", "the community as chorus — collective voice framing individual suffering", "beauty standards as violence internalized by children"],
      "fromAuthorB": ["raw, hallucinatory prose shot through with spiritual yearning", "fractured consciousness — the narrator who cannot fully account for themselves", "degradation rendered without self-pity or moralization"],
      "fromWorkX": ["a child destroyed by an impossible desire — to be what the culture says is beautiful", "seasonal structure — the year as arc of disintegration", "multiple narrative voices circling one tragedy"],
      "fromWorkY": ["linked stories following a narrator through addiction and recovery", "moments of grace erupting in squalid settings", "the unreliable narrator whose unreliability is the story"],
      "targetWordCount": 4800,
      "readingTimeMinutes": 19,
      "themes": "Morrison's communal lyricism meets Johnson's fractured spiritual hunger. A coming-of-age story told in fragments by someone looking back at a childhood they survived but cannot fully reconstruct. Morrison brings the weight of community and history; Johnson brings the hallucinatory intimacy of a consciousness that has been damaged by what it witnessed."
    },
    {
      "id": "lf-autofiction-001",
      "subgenre": "autofiction",
      "authorA": "Rachel Cusk",
      "authorB": "Vladimir Nabokov",
      "workX": "Outline",
      "workY": "Speak, Memory",
      "fromAuthorA": ["austere, essayistic prose where observation replaces conventional narration", "the narrator as negative space — defined by what others reveal", "stripped-down dialogue frames in which other people's stories do the work"],
      "fromAuthorB": ["ornate, playful prose reveling in linguistic pyrotechnics", "memory as reconstruction — the past made more vivid than it ever was", "the unreliable memoirist whose art improves upon reality"],
      "fromWorkX": ["a writer on a trip who listens more than she speaks", "other people's confessions becoming the narrator's portrait by subtraction", "the novel that questions whether the self is a story or an absence"],
      "fromWorkY": ["childhood recalled with preternatural sensory precision", "the émigré's lost world reconstructed in language", "butterflies, chess, and language — pattern-seeking as autobiography"],
      "targetWordCount": 4400,
      "readingTimeMinutes": 18,
      "themes": "Cusk's austere observation meets Nabokov's ornamental memory. An autofiction that oscillates between two modes: the narrator who refuses to narrate themselves and the narrator who narrates themselves too beautifully. The tension between Cusk's withholding and Nabokov's excess creates a portrait of someone whose relationship to their own past keeps shifting between erasure and embellishment."
    },
    {
      "id": "lf-domestic-family-001",
      "subgenre": "domestic-family-drama",
      "authorA": "Marilynne Robinson",
      "authorB": "Flannery O'Connor",
      "workX": "Gilead",
      "workY": "Wise Blood",
      "fromAuthorA": ["meditative, theological prose giving radiant attention to ordinary life", "long, cadenced sentences that think their way toward meaning", "the sacred discovered in domestic routine"],
      "fromAuthorB": ["darkly comic Southern Gothic with grotesque characters", "violent moments of grace — salvation arriving as catastrophe", "religious fervor as both authentic experience and dangerous delusion"],
      "fromWorkX": ["a dying father writing to a son he will not see grow up", "the letter as confession — what a life means when you must summarize it", "Ames, Iowa, as a place where nothing happens and everything matters"],
      "fromWorkY": ["a man fleeing from a calling he cannot escape", "the Church Without Christ — faith defined by what it rejects", "the body mortified as spiritual practice and as madness"],
      "targetWordCount": 5600,
      "readingTimeMinutes": 22,
      "themes": "Robinson's theological tenderness meets O'Connor's violent grace. A domestic drama where faith is the family's inheritance — but one member received it as contemplation and another as compulsion. Robinson brings the quiet; O'Connor brings the disruption. The story is about what happens when both versions of belief live under the same roof."
    },
    {
      "id": "lf-domestic-family-002",
      "subgenre": "domestic-family-drama",
      "authorA": "William Faulkner",
      "authorB": "Kazuo Ishiguro",
      "workX": "As I Lay Dying",
      "workY": "The Remains of the Day",
      "fromAuthorA": ["dense, labyrinthine sentences with multiple timelines embedded", "Southern family mythology built on decay and denial", "multiple narrators orbiting a single event, each seeing different truths"],
      "fromAuthorB": ["restrained, understated narration where devastation arrives in what is not said", "unreliable memory — the narrator who has revised their own history", "quiet service as a form of self-erasure"],
      "fromWorkX": ["a family journey that is also a family disintegration", "the dead mother as the center around which the living revolve", "each family member narrating from within their private obsession"],
      "fromWorkY": ["a life of service reconsidered too late", "the great house as the world — nothing beyond its boundaries matters", "dignity as armor and as prison"],
      "targetWordCount": 7200,
      "readingTimeMinutes": 29,
      "themes": "Faulkner's polyphonic family mythology meets Ishiguro's devastating restraint. A domestic drama told by multiple family members, each of whom has a different version of why the family failed. Faulkner brings the chaotic multiplicity of perspectives; Ishiguro brings the silence at the center — the thing everyone is circling but no one will name."
    },
    {
      "id": "lf-womens-feminist-001",
      "subgenre": "womens-feminist-literary-fiction",
      "authorA": "Virginia Woolf",
      "authorB": "Chimamanda Ngozi Adichie",
      "workX": "Mrs Dalloway",
      "workY": "Americanah",
      "fromAuthorA": ["stream of consciousness — time as subjective flow, not clock time", "luminous interiority where a thought can last pages", "the party, the walk, the errand as arena for existential reckoning"],
      "fromAuthorB": ["the immigrant's sharp-eyed observation of a culture that misreads her", "race and gender as intersecting lenses on social performance", "romance that is also political education"],
      "fromWorkX": ["a single day containing an entire life — preparation for a party as philosophical act", "Clarissa and Septimus — parallel lives connected by an ambulance siren", "the hostess as artist, composing an evening that will dissolve by midnight"],
      "fromWorkY": ["a blog as consciousness — the protagonist narrating her own cultural education", "hair as politics — the body as site of racial performance and resistance", "the return home as discovery that home has changed, or you have"],
      "targetWordCount": 5800,
      "readingTimeMinutes": 23,
      "themes": "Woolf's luminous interiority meets Adichie's cultural precision. A story about a woman preparing for an event — a party, a gathering, a return — and the preparation becoming a way of thinking through everything she has become and failed to become. Woolf brings the subjective time; Adichie brings the awareness that interiority is a luxury shaped by race, class, and geography."
    },
    {
      "id": "lf-campus-academic-001",
      "subgenre": "campus-academic-novel",
      "authorA": "Vladimir Nabokov",
      "authorB": "George Saunders",
      "workX": "Pnin",
      "workY": "CivilWarLand in Bad Decline",
      "fromAuthorA": ["dazzling wordplay and linguistic pyrotechnics deployed with precision", "the émigré professor as comic and tragic figure simultaneously", "unreliable narrators whose charm conceals their cruelty"],
      "fromAuthorB": ["absurdist corporate satire with radical empathy for the trapped", "vernacular voices in surreal institutional situations", "the worker who knows the system is insane but cannot leave it"],
      "fromWorkX": ["Pnin navigating American academia as a lovable, dignified outsider", "the university as a world of petty cruelties masked by intellectual pretension", "language barriers as both comedy and loneliness"],
      "fromWorkY": ["the theme park, the historical reenactment — institutions that sell false versions of reality", "employees performing enthusiasm while the structure crumbles", "violence erupting from beneath the customer-service smile"],
      "targetWordCount": 4200,
      "readingTimeMinutes": 17,
      "themes": "Nabokov's linguistic brilliance meets Saunders's institutional absurdism. A campus novel about a visiting professor at a university that has been restructured along corporate lines — and the professor's Old World dignity colliding with the New World's insistence that everything, including thought, must be monetized. Funny and devastating in alternating sentences."
    },
    {
      "id": "lf-slipstream-surrealist-001",
      "subgenre": "slipstream-surrealist",
      "authorA": "George Saunders",
      "authorB": "James Joyce",
      "workX": "Lincoln in the Bardo",
      "workY": "Dubliners",
      "fromAuthorA": ["absurdist premises treated with radical emotional sincerity", "chorus of voices — the polyphonic dead", "vernacular American speech rendered with comic-tragic precision"],
      "fromAuthorB": ["the epiphany — sudden moments of devastating clarity", "Dublin as a city of paralysis, each story a different form of being stuck", "stories that end not with resolution but with a shift in perception"],
      "fromWorkX": ["the afterlife as bureaucratic waiting room populated by the self-deluded", "grief so powerful it bends the boundary between living and dead", "historical documents and fictional voices braided into a single narrative"],
      "fromWorkY": ["the dinner party, the funeral, the chance encounter — small social occasions revealing whole lives", "snow falling on the living and the dead", "the moment when a character realizes they have been a ghost in their own life"],
      "targetWordCount": 3800,
      "readingTimeMinutes": 15,
      "themes": "Saunders's ghostly polyphony meets Joyce's paralytic epiphanies. A slipstream story where the boundary between the living and the dead is blurred not by magic but by habit — characters who have been going through the motions so long they cannot tell whether they are alive or haunting. The surrealism is social: the uncanniest thing is how normal the abnormal has become."
    },
    {
      "id": "lf-epistolary-fragmented-001",
      "subgenre": "epistolary-fragmented-narrative",
      "authorA": "Rachel Cusk",
      "authorB": "William Faulkner",
      "workX": "Transit",
      "workY": "The Sound and the Fury",
      "fromAuthorA": ["the narrator as listening device — other people's stories composing the portrait", "renovation as metaphor — tearing down and rebuilding while living in the wreckage", "conversations that are really monologues, and monologues that are really confessions"],
      "fromAuthorB": ["time fractured into competing subjective experiences", "the same events seen by different consciousnesses, each version irreconcilable", "language degrading under the pressure of what it cannot express"],
      "fromWorkX": ["London as a city of strangers confessing to each other on trains and at dinner tables", "divorce as demolition — the life being dismantled while the new one is not yet built", "the writer who gathers stories but will not tell her own"],
      "fromWorkY": ["the idiot, the student, the cynic, and the servant — four narrators, four Americas", "a family's decline told through its members' inability to communicate", "the missing center — Caddy, who never narrates, is the person everyone is talking about"],
      "targetWordCount": 6600,
      "readingTimeMinutes": 26,
      "themes": "Cusk's cool observation meets Faulkner's fractured subjectivity. An epistolary/fragmented story told through documents, conversations, and overlapping accounts — each narrator describing the same family from a different angle, and none of them seeing the person at the center. Cusk brings the formal restraint; Faulkner brings the emotional chaos beneath it."
    },
    {
      "id": "lf-minimalist-001",
      "subgenre": "minimalist-fiction",
      "authorA": "Ernest Hemingway",
      "authorB": "Marilynne Robinson",
      "workX": "In Our Time",
      "workY": "Housekeeping",
      "fromAuthorA": ["terse, declarative sentences where emotion hides beneath surface action", "the theory of omission — what is left out carries the meaning", "war, fishing, bullfighting — ritualized activity as psychological containment"],
      "fromAuthorB": ["meditative prose that finds the infinite in domestic detail", "water, light, and weather as spiritual forces", "the house as philosophical proposition — what does it mean to dwell"],
      "fromWorkX": ["linked vignettes building a portrait of a generation marked by war", "Nick Adams learning to survive by paying attention to the physical world", "the inter-chapters — brutal compression between longer stories"],
      "fromWorkY": ["two sisters raised by an aunt who does not believe in walls", "the house slowly dissolving into the landscape — domesticity returning to nature", "transience as a way of being — the refusal to settle as philosophy"],
      "targetWordCount": 3200,
      "readingTimeMinutes": 13,
      "themes": "Hemingway's omission meets Robinson's contemplation. A minimalist story where the surface is spare and physical — actions, objects, weather — but what hides beneath is theological. Hemingway brings the discipline of leaving things out; Robinson brings the conviction that what is left out is sacred. The reader feels the weight of what is not said."
    },
    {
      "id": "lf-autofiction-002",
      "subgenre": "autofiction",
      "authorA": "Denis Johnson",
      "authorB": "Rachel Cusk",
      "workX": "Already Dead",
      "workY": "Kudos",
      "fromAuthorA": ["raw, hallucinatory prose that makes degradation luminous", "spiritual yearning erupting through damaged characters", "the California coastline as metaphysical landscape"],
      "fromAuthorB": ["austere, essayistic narration — the self as absent center", "public events becoming occasions for private reckoning", "the international literary circuit as theater of performance and exhaustion"],
      "fromWorkX": ["a man planning his own murder as existential project", "Northern California as both paradise and wasteland", "characters driven by desires they cannot articulate or control"],
      "fromWorkY": ["a writer touring foreign countries, collecting other people's revelations", "the interview, the panel, the dinner — professional intimacy as substitute for the real thing", "the narrator's life visible only in its reflection off others"],
      "targetWordCount": 5200,
      "readingTimeMinutes": 21,
      "themes": "Johnson's hallucinatory rawness meets Cusk's austere observation. An autofiction about a writer at a residency or festival who is supposed to be performing the role of writer but keeps slipping into something more dangerous and honest. Johnson brings the spiritual emergency; Cusk brings the formal containment that keeps it from becoming confession."
    },
    {
      "id": "lf-womens-feminist-002",
      "subgenre": "womens-feminist-literary-fiction",
      "authorA": "Toni Morrison",
      "authorB": "Virginia Woolf",
      "workX": "Sula",
      "workY": "To the Lighthouse",
      "fromAuthorA": ["communal voice — the neighborhood as narrator and judge", "female friendship as the central love story of a life", "characters who refuse the categories available to them"],
      "fromAuthorB": ["time passing in a single parenthetical — years compressed into a bracket", "the domestic sphere as arena for philosophical inquiry", "Mrs. Ramsay and Lily Briscoe — the woman who makes the home and the woman who makes the art"],
      "fromWorkX": ["Sula and Nel — two women who are one person split in half", "the Bottom — a Black community mapped in its beauty and cruelty", "the woman who chooses freedom and is punished for it by everyone she knows"],
      "fromWorkY": ["the dinner table as theater — what is served, who sits where, what remains unsaid", "the lighthouse as symbol that means different things to different characters", "the death of the mother and the question of what holds the family together after"],
      "targetWordCount": 7800,
      "readingTimeMinutes": 31,
      "themes": "Morrison's communal mythology meets Woolf's subjective interiority. A feminist literary fiction about two women whose friendship is the most important relationship in both their lives — but one of them has a family and the other has freedom, and the story traces the cost of each choice over decades. Morrison brings the communal judgment; Woolf brings the internal reckoning."
    },
    {
      "id": "lf-campus-academic-002",
      "subgenre": "campus-academic-novel",
      "authorA": "Kazuo Ishiguro",
      "authorB": "Flannery O'Connor",
      "workX": "Never Let Me Go",
      "workY": "Everything That Rises Must Converge",
      "fromAuthorA": ["restrained narration where the horror is in what the narrator accepts as normal", "an institution that defines its inhabitants without their knowledge", "unreliable memory reconstructing a past the narrator cannot face directly"],
      "fromAuthorB": ["the moment of violent revelation — a character forced to see what they have denied", "Southern social comedy with a knife hidden in it", "intellectual pretension masking moral cowardice"],
      "fromWorkX": ["a boarding school whose students do not understand their own purpose", "art class as a test of whether the students have souls", "the love triangle that cannot resolve because none of them will survive"],
      "fromWorkY": ["a bus ride as social confrontation — integration as personal crisis", "mothers and children locked in mutual misunderstanding", "the convergence that is also a collision — grace arriving as disaster"],
      "targetWordCount": 4600,
      "readingTimeMinutes": 18,
      "themes": "Ishiguro's quiet institutional horror meets O'Connor's violent revelations. A campus novel where the university is training its students for something the students do not question — until one does, and the questioning destroys not the institution but the questioner. Ishiguro brings the eerie compliance; O'Connor brings the eruption."
    },
    {
      "id": "lf-slipstream-surrealist-002",
      "subgenre": "slipstream-surrealist",
      "authorA": "Vladimir Nabokov",
      "authorB": "Toni Morrison",
      "workX": "Pale Fire",
      "workY": "Song of Solomon",
      "fromAuthorA": ["the unreliable commentator who hijacks another's text", "wordplay and pattern-making as obsessive, possibly deranged art", "the academic apparatus — index, foreword, notes — as fictional form"],
      "fromAuthorB": ["flight as metaphor — the desire to transcend, and the people left on the ground", "names as power — the stolen name, the chosen name, the ancestral name", "a quest for origin that reveals origin was always a story someone told"],
      "fromWorkX": ["a poem and its commentary — the commentary consuming the poem", "Zembla, the invented country — is it real or is the commentator insane?", "the scholarly footnote as vehicle for confession, delusion, and murder"],
      "fromWorkY": ["Milkman's journey south as journey backward through history", "the myth of the flying Africans — escape as both transcendence and abandonment", "Pilate — the woman who carries her name in an earring and her father's bones in a sack"],
      "targetWordCount": 8200,
      "readingTimeMinutes": 33,
      "themes": "Nabokov's playful formal invention meets Morrison's mythic quest. A slipstream fiction structured as a text with commentary — but the commentary opens into a world that is either mythic or delusional, and the reader must decide. Nabokov brings the formal game; Morrison brings the ancestral haunting that makes the game matter."
    },
    {
      "id": "lf-minimalist-002",
      "subgenre": "minimalist-fiction",
      "authorA": "Ernest Hemingway",
      "authorB": "Chimamanda Ngozi Adichie",
      "workX": "The Sun Also Rises",
      "workY": "The Thing Around Your Neck",
      "fromAuthorA": ["dialogue carrying the weight of what characters will not say directly", "expatriate life — drinking, traveling, performing ease while damaged", "landscape as emotional register — the clean, well-lighted place vs. the darkness"],
      "fromAuthorB": ["the immigrant observing a culture that flattens her into a category", "precise, luminous short fiction — every sentence earns its place", "the return to Nigeria as confrontation with a self left behind"],
      "fromWorkX": ["the lost generation abroad — people who survived the war but not intact", "the fiesta, the bullfight — ritual spectacle as substitute for feeling", "Jake's wound — the thing that cannot be spoken about directly"],
      "fromWorkY": ["a Nigerian woman in America discovering which parts of herself survive transplantation", "the thing around your neck — anxiety, displacement, the tightening of an invisible constraint", "love across cultures as both liberation and new confinement"],
      "targetWordCount": 3400,
      "readingTimeMinutes": 14,
      "themes": "Hemingway's expatriate restraint meets Adichie's immigrant precision. A minimalist story about someone living abroad who performs belonging — the right cafes, the right conversations — while carrying a wound that cannot be discussed in this language. Hemingway brings the theory of omission; Adichie brings the awareness that what gets omitted is often determined by who is allowed to speak."
    }
  ]
}
