{
  "genre": "magical-realism",
  "generatedDate": "2026-02-21",
  "combinations": [
    {
      "id": "mgr-south-asian-001",
      "subgenre": "south-asian",
      "authorA": "Salman Rushdie",
      "authorB": "Laura Esquivel",
      "workX": "Midnight's Children",
      "workY": "The White Tiger",
      "fromAuthorA": ["maximalist, exuberant, politically charged prose — linguistic pyrotechnics", "postcolonial magical realism where history is too enormous for realism alone", "the narrator whose body is a map of their nation's fractures"],
      "fromAuthorB": ["sensory, food-centered magical realism — emotion as physical force", "domestic spaces where passion manifests as literal transformation", "recipes as narrative structure — the practical and the magical inseparable"],
      "fromWorkX": ["children born at the stroke of independence, each gifted and cursed by the nation's birth", "memory as unreliable narration — the storyteller who may be inventing their own country", "the chutnification of history — preserving the past by transforming it"],
      "fromWorkY": ["the servant's-eye view of India's class system — rage sharpened into dark comedy", "Bangalore's call centers and malls as the new magical spaces", "the entrepreneurial murder — killing as the only available form of social mobility"],
      "targetWordCount": 6200,
      "readingTimeMinutes": 25,
      "themes": "Rushdie's maximalist political exuberance meets Esquivel's sensory domestic magic. A South Asian magical realism where a cook's spices literally alter the emotions of those who eat — but the story is also about a nation's class violence, told through kitchens and dining rooms where what the servant prepares and what the master consumes are two different realities. Rushdie gives the national scope; Esquivel gives the kitchen its power."
    },
    {
      "id": "mgr-south-asian-002",
      "subgenre": "south-asian",
      "authorA": "Isabel Allende",
      "authorB": "Haruki Murakami",
      "workX": "The God of Small Things",
      "workY": "The House of the Spirits",
      "fromAuthorA": ["sensuous family-saga magical realism — strong women carrying generations", "Chilean-inflected passion and political history", "the matriarch whose gifts define and imprison her descendants"],
      "fromAuthorB": ["dreamlike, melancholic, deadpan prose — loneliness and the surreal coexisting", "Western music and jazz as portals to emotional states", "the ordinary apartment as site of metaphysical disruption"],
      "fromWorkX": ["the love laws — who can love whom, and how much", "a single traumatic event fractured across decades of non-linear telling", "the twins as two halves of one consciousness, separated by caste and circumstance"],
      "fromWorkY": ["women with clairvoyance navigating a patriarchal political landscape", "the house as repository of family memory — each room a generation", "the coup as the moment magic cannot prevent, only witness"],
      "targetWordCount": 4400,
      "readingTimeMinutes": 18,
      "themes": "Allende's passionate family saga meets Murakami's melancholic dreaminess. A South Asian magical realism about a family whose women inherit a gift — each generation a different manifestation — but the gift cannot protect them from the social structures that determine their lives. Allende provides the generational sweep and the women's fierce agency; Murakami provides the quiet, dreamlike spaces between the crises where the magic actually lives."
    },
    {
      "id": "mgr-japanese-001",
      "subgenre": "japanese",
      "authorA": "Haruki Murakami",
      "authorB": "Jorge Luis Borges",
      "workX": "Kafka on the Shore",
      "workY": "The Wind-Up Bird Chronicle",
      "fromAuthorA": ["dreamlike, deadpan prose — the surreal presented as mundanely as breakfast", "Western jazz and literature as emotional navigation system", "loneliness as a landscape the protagonist inhabits rather than escapes"],
      "fromAuthorB": ["philosophical, labyrinthine short fiction — infinity in miniature", "libraries and mirrors as portals to other modes of being", "cerebral magic — the universe as intellectual puzzle that reshapes the solver"],
      "fromWorkX": ["the runaway teenager and the elderly man who talks to cats — parallel journeys converging", "the library as liminal space between waking and dream", "Oedipal prophecy played straight and sideways simultaneously"],
      "fromWorkY": ["the missing wife as the mystery that unravels everything else", "the well as portal — descent into darkness to find what was lost", "the war history buried in the backyard — literal and metaphorical"],
      "targetWordCount": 3800,
      "readingTimeMinutes": 15,
      "themes": "Murakami's domestic surrealism meets Borges's intellectual labyrinth. A Japanese magical realism where a man searching for something lost enters a library that contains not books but rooms, each room a day from someone else's life. Murakami provides the deadpan loneliness of the search and the jazz playing somewhere in the distance; Borges provides the architecture of the impossible library and the creeping suspicion that the searcher is also a book on someone else's shelf."
    },
    {
      "id": "mgr-japanese-002",
      "subgenre": "japanese",
      "authorA": "Samanta Schweblin",
      "authorB": "Haruki Murakami",
      "workX": "Convenience Store Woman",
      "workY": "Fever Dream",
      "fromAuthorA": ["Argentine uncanny — domestic spaces made strange through precise, clinical prose", "dread in miniature — horror compressed into the everyday", "fever-dream pacing that never lets the reader settle"],
      "fromAuthorB": ["dreamlike, melancholic deadpan where the surreal is unremarkable", "the lonely protagonist whose isolation is both affliction and gift", "cats, jazz, and cooking as anchors in a world that keeps shifting"],
      "fromWorkX": ["the worker who finds meaning only in the ritual of their labor", "society's horror at someone who doesn't want what they're supposed to want", "the convenience store as the entire world — complete, sufficient, strange"],
      "fromWorkY": ["the poisoned child and the mother's desperate, non-linear narration", "the rescue distance — how far away you can be from your child and still save them", "the body invaded by something that changes it from the inside"],
      "targetWordCount": 2800,
      "readingTimeMinutes": 11,
      "themes": "Schweblin's domestic dread meets Murakami's melancholic surrealism. A Japanese magical realism set in a convenience store where the night-shift worker begins to notice that the products are rearranging themselves — or that they always have been, and she's only now seeing it. Schweblin provides the mounting unease; Murakami provides the protagonist's strange calm acceptance. The magic is not spectacular but quiet, systemic, and possibly only visible to someone society has already decided is wrong."
    },
    {
      "id": "mgr-fabulism-001",
      "subgenre": "fabulism",
      "authorA": "Karen Russell",
      "authorB": "Italo Calvino",
      "workX": "The Metamorphosis",
      "workY": "Piranesi",
      "fromAuthorA": ["American fabulism — inventive premises rendered with swamp-Gothic sensory language", "playful, densely textured prose that makes the impossible feel muddy and real", "the natural world as source of wonder that is also uncomfortable and wet"],
      "fromAuthorB": ["playful, structurally inventive prose — the joy of literary possibility", "fables for adults — moral architecture without moralism", "lightness as philosophy — the balloon, the tree, the invisible city"],
      "fromWorkX": ["waking up as something else — transformation without explanation or reversal", "the family's adjustment to the monstrous as the real horror", "the mundane logistics of impossibility — how do you get to work as a beetle"],
      "fromWorkY": ["a solitary figure cataloguing the wonders of a world they don't understand", "the slow revelation that the beautiful prison is a prison", "beauty found in confinement — the trap that feels like worship"],
      "targetWordCount": 3200,
      "readingTimeMinutes": 13,
      "themes": "Russell's swamp-Gothic inventiveness meets Calvino's philosophical lightness. A fabulist story where someone discovers they can grow a garden in any surface — asphalt, drywall, their own skin — and the story follows the logic of the gift with Russell's sensory excess and Calvino's structural playfulness. The fable is about abundance as affliction: when you can make anything grow, what do you do with a world that's already too full?"
    },
    {
      "id": "mgr-fabulism-002",
      "subgenre": "fabulism",
      "authorA": "Gabriel García Márquez",
      "authorB": "Karen Russell",
      "workX": "The House of the Spirits",
      "workY": "Grimms' Fairy Tales",
      "fromAuthorA": ["lush, sweeping, matter-of-fact magical prose — miracles as weather", "circular time where generations repeat and rhyme", "the patriarch and matriarch whose gifts and flaws cascade through descendants"],
      "fromAuthorB": ["American fabulism — playful, sensory, tactile prose with a swamp-Gothic edge", "inventive premises grounded in specific, uncomfortable physical detail", "the natural world as both wonder and threat — beauty with teeth"],
      "fromWorkX": ["the family mansion as living archive of magical history", "women with clairvoyance shaping history from the margins", "the political coup that breaks the magic — or reveals it was never enough"],
      "fromWorkY": ["the enchanted forest as moral testing ground", "transformation as punishment and gift simultaneously", "the rule that must not be broken — and the inevitability of its breaking"],
      "targetWordCount": 4100,
      "readingTimeMinutes": 16,
      "themes": "García Márquez's matter-of-fact miracles meet Russell's tactile American fabulism. A story where a family's children are each born with a single impossible trait — one can hear the future, one weighs nothing on Tuesdays, one's tears crystallize — told with Márquez's serene acceptance and Russell's sensory specificity about what these gifts actually feel like in the body. Not whimsy but lived strangeness, funny and sad and physical."
    },
    {
      "id": "mgr-slipstream-001",
      "subgenre": "slipstream",
      "authorA": "Jorge Luis Borges",
      "authorB": "Samanta Schweblin",
      "workX": "If on a winter's night a traveler",
      "workY": "The Memory Police",
      "fromAuthorA": ["philosophical, labyrinthine fictions — infinity in miniature", "the library, the mirror, the maze as recurring architectures of thought", "cerebral magic that operates through logic, not wonder"],
      "fromAuthorB": ["Argentine uncanny — fever-dream pacing in domestic spaces", "dread compressed into the everyday — the familiar made wrong", "precise, clinical prose that withholds exactly enough to sustain unease"],
      "fromWorkX": ["the novel that keeps beginning and never finishing — narrative as labyrinth", "the reader as character trapped in the act of reading", "metafiction that is also a love story, a thriller, and a philosophical puzzle"],
      "fromWorkY": ["things disappearing from the world — and from memory — one by one", "the resistance to forgetting as a political act", "the island where reality is being slowly subtracted"],
      "targetWordCount": 7400,
      "readingTimeMinutes": 30,
      "themes": "Borges's intellectual architecture meets Schweblin's domestic dread. A slipstream story where a neighborhood begins losing concepts — not objects but abstractions. First, irony disappears. Then everyone forgets what hesitation was. Borges provides the philosophical rigor of the premise; Schweblin provides the mounting horror of living through it. The story bends reality without breaking it — you're never sure if this is magical realism or a clinical description of cognitive decline."
    },
    {
      "id": "mgr-slipstream-002",
      "subgenre": "slipstream",
      "authorA": "Haruki Murakami",
      "authorB": "Toni Morrison",
      "workX": "Never Let Me Go",
      "workY": "The Unconsoled",
      "fromAuthorA": ["dreamlike, melancholic prose where the surreal and mundane are the same register", "the lonely protagonist navigating a world whose rules are felt but never stated", "the well, the cat, the empty apartment — recurring symbols of metaphysical absence"],
      "fromAuthorB": ["lyrical, incantatory prose with mythic resonance", "ancestral memory carried in the body — the past as living haunting", "communal reckoning with history that has been deliberately forgotten"],
      "fromWorkX": ["the quiet dystopia where the characters barely notice their own oppression", "the boarding school as contained world with its own mythology", "the slow reveal of what the reader suspects long before the characters admit it"],
      "fromWorkY": ["the concert pianist in a city that keeps rearranging itself", "dream-logic applied to social obligation — the task that never ends", "the protagonist who cannot remember why they came or what they promised"],
      "targetWordCount": 5800,
      "readingTimeMinutes": 23,
      "themes": "Murakami's dream-logic melancholy meets Morrison's incantatory historical reckoning. A slipstream where a musician arrives in a town to perform a concert that keeps being postponed — and each day the town is slightly different, its history rewritten overnight, its residents remembering different pasts. Murakami provides the placid acceptance of the impossible; Morrison provides the insistence that forgetting is not innocent, that someone chose what the town remembers."
    },
    {
      "id": "mgr-african-magical-realism-002",
      "subgenre": "african-magical-realism",
      "authorA": "Ben Okri",
      "authorB": "Salman Rushdie",
      "workX": "Things Fall Apart",
      "workY": "A Grain of Wheat",
      "fromAuthorA": ["spirit-child narratives — the cyclical journey between worlds", "Nigerian magical realism rooted in Yoruba cosmology", "mythic, cyclical prose where the dead and living share the same roads"],
      "fromAuthorB": ["maximalist, exuberant prose — linguistic pyrotechnics and political fury", "postcolonial magical realism that mirrors a nation's impossible contradictions", "the narrator who is also the nation, whose body carries the collective history"],
      "fromWorkX": ["the village world shattered by colonial contact", "the strong man whose greatness is also his inflexibility", "the proverb as structural unit — each scene a parable the community tells itself"],
      "fromWorkY": ["independence day as the moment that reveals every secret and betrayal", "the Mau Mau rebellion — sacrifice, collaboration, and the cost of freedom", "the land as the thing fought for and the thing that cannot be returned to"],
      "targetWordCount": 3400,
      "readingTimeMinutes": 14,
      "themes": "Okri's spirit-world cosmology meets Rushdie's political maximalism. An African magical realism set on the day of a nation's independence, when the ancestral spirits return to witness what was won — and to demand an accounting. Okri provides the permeable membrane between the living and the dead; Rushdie provides the political carnival of independence day, where every promise and every betrayal is simultaneously true."
    },
    {
      "id": "mgr-latin-american-002",
      "subgenre": "latin-american-magical-realism",
      "authorA": "Isabel Allende",
      "authorB": "Jorge Luis Borges",
      "workX": "Pedro Páramo",
      "workY": "Like Water for Chocolate",
      "fromAuthorA": ["sensuous family-saga magical realism — passion, revolution, women's fury", "the matriarch as center of gravity for a century of national history", "Chilean landscape and politics rendered through the body's experience of them"],
      "fromAuthorB": ["philosophical, labyrinthine fictions — cerebral magic operating through logic", "the infinite library, the garden of forking paths, the circular ruin", "the short story as intellectual architecture — every word load-bearing"],
      "fromWorkX": ["the town of the dead — a man arrives seeking his father and finds only ghosts", "the voices of the dead narrating their own stories simultaneously", "the hacienda as site of tyranny, passion, and slow decay"],
      "fromWorkY": ["cooking as alchemy — recipes that transmit emotion through food", "the twelve months as narrative structure — desire indexed to the calendar", "the woman whose passion is too large for the domestic world that contains her"],
      "targetWordCount": 8200,
      "readingTimeMinutes": 33,
      "themes": "Allende's passionate family-saga energy meets Borges's labyrinthine intellectual architecture. A Latin American magical realism structured as a house with rooms that open onto different decades — the protagonist walks through doors and finds their grandmother's kitchen in 1952, their own childhood in 1986, a room that hasn't happened yet. Allende provides the sensuous, political family drama; Borges provides the impossible architecture and the suspicion that the house is not a house but a proof."
    }
  ]
}
