{
  "genre": "mystery-thriller",
  "generatedDate": "2026-02-21",
  "combinations": [
    {
      "id": "mys-police-procedural-001",
      "subgenre": "police-procedural",
      "authorA": "John le Carre",
      "authorB": "Dennis Lehane",
      "workX": "Tinker Tailor Soldier Spy",
      "workY": "Mystic River",
      "fromAuthorA": ["dense, bureaucratic prose that makes institutional procedure feel like spiritual exhaustion", "the mole hunt as organizational self-destruction — trust corroded from within", "moral weariness rendered through syntax: long, qualifying clauses that defer certainty"],
      "fromAuthorB": ["working-class Boston authenticity — neighborhoods as moral ecosystems with their own laws", "emotional devastation buried beneath procedural competence", "the detective who cannot separate the case from the damage it does to everyone near it"],
      "fromWorkX": ["the investigation that turns inward — the enemy is one of us", "loyalty tests that reveal nothing because the guilty are the most loyal", "institutional betrayal as the deepest wound: the system you served was never what you thought"],
      "fromWorkY": ["childhood trauma surfacing decades later through violence", "three boys who became three men, and the crime that maps onto who they became", "justice and revenge as indistinguishable impulses dressed in different uniforms"],
      "targetWordCount": 6800,
      "readingTimeMinutes": 27,
      "themes": "A homicide detective investigating the murder of a retired colleague discovers the killing connects to a decades-old internal affairs case that her own precinct buried. Le Carre's institutional paranoia meets Lehane's neighborhood grief. The procedural becomes an excavation — not of evidence, but of everything the department agreed never to mention."
    },
    {
      "id": "mys-police-procedural-002",
      "subgenre": "police-procedural",
      "authorA": "Tana French",
      "authorB": "Dashiell Hammett",
      "workX": "The Likeness",
      "workY": "The Maltese Falcon",
      "fromAuthorA": ["atmospheric, psychologically dense narration where the detective's identity contaminates the investigation", "Dublin rendered as a landscape of memory and dread", "the undercover assignment that dissolves the boundary between investigator and suspect"],
      "fromAuthorB": ["spare, objective prose that reports action and dialogue without interior commentary", "the detective as moral cipher — Sam Spade's opacity as ethical stance", "no wasted sentences; every detail is either evidence or misdirection"],
      "fromWorkX": ["a detective assuming a dead woman's identity to catch her killer — and finding the dead woman's life fits better than her own", "the communal house where everyone is performing a version of themselves", "the investigation that cannot succeed without the investigator losing herself"],
      "fromWorkY": ["the object everyone wants that may be worthless — the falcon as engine of desire and betrayal", "loyalty tested to destruction: everyone will sell out everyone", "the ending where the detective does the right thing and it costs everything personal"],
      "targetWordCount": 7400,
      "readingTimeMinutes": 30,
      "themes": "A detective goes undercover inside a closed unit of fellow officers suspected of evidence tampering, only to find that the fabricated cases may have convicted people who were actually guilty — by accident or design, no one can say. French's identity dissolution meets Hammett's brutal objectivity. The procedural question is simple: who planted the evidence? The real question is whether the answer matters."
    },
    {
      "id": "mys-espionage-spy-001",
      "subgenre": "espionage-spy",
      "authorA": "John le Carre",
      "authorB": "Patricia Highsmith",
      "workX": "The Spy Who Came in from the Cold",
      "workY": "Strangers on a Train",
      "fromAuthorA": ["the moral exhaustion of espionage — every act of loyalty is also a betrayal", "layered, literary prose that makes the spy genre feel like moral philosophy", "Berlin as spiritual landscape: divided, surveilled, cold"],
      "fromAuthorB": ["the intimate, suffocating relationship between two people bound by a shared secret", "moral contagion — evil as something you catch through proximity", "clinical precision in rendering the psychology of people doing terrible things calmly"],
      "fromWorkX": ["the agent sacrificed by his own service to maintain a larger deception", "the come-in-from-the-cold promise that is itself a trap", "ideological conviction rotting from the inside while the spy continues to perform belief"],
      "fromWorkY": ["two strangers who agree to commit each other's crimes — the pact that cannot be undone", "the double as mirror: each man sees in the other what he cannot face in himself", "guilt as a bond stronger than friendship or love"],
      "targetWordCount": 5600,
      "readingTimeMinutes": 22,
      "themes": "Two intelligence officers from opposing services, each tasked with recruiting the other, discover their handlers are the same person. Le Carre's institutional betrayal meets Highsmith's psychological entanglement. Espionage as a closed loop: the spy who recruits you and the spy who runs you are the same, and always were."
    },
    {
      "id": "mys-espionage-spy-002",
      "subgenre": "espionage-spy",
      "authorA": "Arthur Conan Doyle",
      "authorB": "Donna Tartt",
      "workX": "The Adventure of the Bruce-Partington Plans",
      "workY": "The Goldfinch",
      "fromAuthorA": ["Watson's warm, admiring narration that makes the extraordinary feel gentlemanly", "deductive set-pieces — the chain of reasoning that transforms scattered facts into certainty", "fog-shrouded London as both setting and atmosphere: gaslight, hansom cabs, empire's confidence"],
      "fromAuthorB": ["literary density applied to genre — obsessive, sensory detail that slows the reader into the world", "an object of immense value that becomes the protagonist's secret burden", "the long aftermath: how a single event shapes decades of decisions"],
      "fromWorkX": ["state secrets gone missing — the stolen plans that could topple empires", "the body on the Underground tracks, and the question of how it got there", "Mycroft Holmes: the brother who IS the government, who moves nations from an armchair"],
      "fromWorkY": ["the stolen masterpiece that becomes both talisman and curse", "a life organized around concealing one secret, and the distortions that concealment produces", "guilt and love entangled around a single object that cannot be returned without confession"],
      "targetWordCount": 8200,
      "readingTimeMinutes": 33,
      "themes": "A retired signals analyst discovers that a classified document she smuggled out of a Cold War embassy thirty years ago — her insurance policy, never used — has become the key to a current diplomatic crisis, and the people who want it include the service she once believed was protecting her. Doyle's deductive confidence meets Tartt's obsessive attachment to objects. The spy story as long-form guilt: what you stole to survive becomes what you cannot live with."
    },
    {
      "id": "mys-legal-thriller-001",
      "subgenre": "legal-thriller",
      "authorA": "Donna Tartt",
      "authorB": "Agatha Christie",
      "workX": "The Secret History",
      "workY": "Witness for the Prosecution",
      "fromAuthorA": ["lush, hypnotic prose that renders intellectual environments as dangerously seductive", "the confession that comes too late and changes nothing — guilt as a permanent condition", "characters who commit terrible acts for beautiful reasons and cannot separate the beauty from the crime"],
      "fromAuthorB": ["intricate plot mechanics where the twist reframes everything that preceded it", "misdirection through social performance — characters who deceive by playing exactly what they appear to be", "the revelation delivered in a public setting: the courtroom, the drawing room, the moment of exposure"],
      "fromWorkX": ["the small group bound by a shared crime, turning on each other under institutional pressure", "classical education as moral corruption — knowing Greek tragedy while living one", "the narrator who participated and now must testify, implicated in every version of events"],
      "fromWorkY": ["the courtroom as theater — the witness whose testimony is a performance", "the twist that inverts victim and perpetrator", "loyalty tested under oath: the person who lies for you may be lying about everything"],
      "targetWordCount": 5200,
      "readingTimeMinutes": 21,
      "themes": "A law professor is called to testify at the trial of a former student accused of killing another student during what may have been a ritual gone wrong — or a murder dressed as one. Tartt's campus seduction meets Christie's courtroom machinery. The legal thriller as confessional: the witness stand as the one place where you cannot control the story."
    },
    {
      "id": "mys-legal-thriller-002",
      "subgenre": "legal-thriller",
      "authorA": "Gillian Flynn",
      "authorB": "Dennis Lehane",
      "workX": "Gone Girl",
      "workY": "Shutter Island",
      "fromAuthorA": ["sharp, venomous first-person narration that makes the reader complicit in the narrator's cruelty", "the unreliable female narrator who weaponizes expectations about women", "marriage as crime scene — intimacy as the deepest form of evidence"],
      "fromAuthorB": ["working-class moral gravity — characters who know the cost of everything because they've paid it", "noir with heart: the detective who cares too much and pays for it", "institutions (hospitals, courts, prisons) as machines that process people into categories"],
      "fromWorkX": ["the diary that rewrites the marriage — competing narratives of the same relationship", "the missing wife who is the author of her own disappearance", "media trial: the public narrative that devours the private truth"],
      "fromWorkY": ["the investigation that is itself a therapeutic intervention — or a trap", "the island facility where the boundary between doctor and patient dissolves", "the twist that asks whether knowing the truth is better than the constructed reality"],
      "targetWordCount": 4600,
      "readingTimeMinutes": 18,
      "themes": "A public defender takes the case of a woman accused of staging her own kidnapping for insurance money — a woman who insists the kidnapping was real, the ransom was paid, and the person who took her is sitting in the courtroom. Flynn's weaponized narration meets Lehane's institutional dread. The legal thriller as hall of mirrors: every piece of evidence supports two incompatible stories, and the jury has to pick one."
    },
    {
      "id": "mys-locked-room-001",
      "subgenre": "locked-room",
      "authorA": "Agatha Christie",
      "authorB": "Daphne du Maurier",
      "workX": "And Then There Were None",
      "workY": "Rebecca",
      "fromAuthorA": ["precision-engineered plot where each death is both inevitable and surprising", "the closed-world mystery: a finite number of suspects, no escape, no outside help", "deceptively simple prose that conceals structural brilliance — every sentence is evidence"],
      "fromAuthorB": ["Gothic atmosphere that makes the house itself a suspect", "unnamed or partially unnamed narrators defined by the spaces they inhabit", "dread and romantic obsession fused into a single emotional register — the lover as threat"],
      "fromWorkX": ["the island where guests are killed according to a nursery rhyme — the pattern as trap", "escalating paranoia: every survivor is both potential victim and potential killer", "the impossible crime: everyone is dead, no killer remains, so who did it?"],
      "fromWorkY": ["the dead woman whose presence dominates the house more completely than any living occupant", "the second wife who discovers the marriage she entered is haunted by the first", "the housekeeper as guardian of secrets — loyalty to the dead as weapon against the living"],
      "targetWordCount": 5800,
      "readingTimeMinutes": 23,
      "themes": "Five heirs gather at a coastal estate for the reading of a will, only to find the solicitor dead in a sealed study — and the will itself missing. As a storm cuts them off, each heir receives a letter from the deceased naming one of them as the killer. Christie's clockwork precision meets du Maurier's Gothic dread. The locked room is the house itself: no one can leave, and the dead woman's arrangements ensure no one can trust anyone who stays."
    },
    {
      "id": "mys-locked-room-002",
      "subgenre": "locked-room",
      "authorA": "Arthur Conan Doyle",
      "authorB": "Gillian Flynn",
      "workX": "The Adventure of the Speckled Band",
      "workY": "Sharp Objects",
      "fromAuthorA": ["the deductive set-piece: the detective examining a room and reading its history from scratches, stains, and angles", "Victorian adventure energy — the brilliant detective and the atmospheric manor", "Holmes's cold rationalism applied to seemingly supernatural events — the explanation is always material"],
      "fromAuthorB": ["the return to a hometown that is also a return to a crime scene", "female bodies as sites of violence and evidence — the text written on skin", "small-town surfaces hiding monstrous interiors — the community that protects its own darkness"],
      "fromWorkX": ["the sealed bedroom where a woman dies impossibly — the locked room as patriarchal trap", "the snake, the ventilator, the bell-pull: the mundane object weaponized through architecture", "a father's 'protection' that is itself the mechanism of murder"],
      "fromWorkY": ["the journalist investigating a story that mirrors her own buried trauma", "self-harm as a language the body speaks when the mouth cannot", "the mother whose care is indistinguishable from control, whose love is the locked room"],
      "targetWordCount": 3600,
      "readingTimeMinutes": 14,
      "themes": "A forensic architect called to explain how a woman died in a hermetically sealed archive discovers the room's ventilation system was redesigned by the victim herself — ostensibly for climate control, but the modifications make no sense unless someone wanted a way in. Doyle's deductive precision meets Flynn's domestic horror. The locked room as self-constructed trap: the victim built the mechanism, but the question is whether she knew what she was building."
    },
    {
      "id": "mys-domestic-thriller-001",
      "subgenre": "domestic-thriller",
      "authorA": "Gillian Flynn",
      "authorB": "Daphne du Maurier",
      "workX": "Dark Places",
      "workY": "My Cousin Rachel",
      "fromAuthorA": ["venomous, darkly comic narration from protagonists who are difficult to like and impossible to look away from", "poverty and class resentment as engines of violence — the crime that grows from economic desperation", "the unreliable narrator who is unreliable not because she lies but because she doesn't care enough to be accurate"],
      "fromAuthorB": ["romantic suspicion — the lover who may be a murderer, and desire that survives the suspicion", "ambiguity sustained to the final line: the reader is never told the truth, only given competing versions", "landscape as emotional state — the coast, the garden, the weather as extensions of dread"],
      "fromWorkX": ["the family massacre revisited decades later — the survivor who may also be the guilty party", "satanic panic, media frenzy, and the narrative that hardens into accepted history", "the protagonist who monetizes her own trauma and cannot stop picking at the wound"],
      "fromWorkY": ["the cousin who arrives as savior or predator — the inheritance that may be legitimate or theft", "the narrator consumed by suspicion who cannot determine if his suspicion is evidence or paranoia", "the ending that refuses to exonerate or convict — the reader inherits the narrator's uncertainty"],
      "targetWordCount": 5400,
      "readingTimeMinutes": 22,
      "themes": "A woman inherits her estranged sister's house and discovers her sister's husband living in it — grief-stricken, helpful, and refusing to leave. As she sorts through her sister's belongings, she finds evidence that the marriage was either deeply loving or meticulously controlled, and every object in the house supports both readings. Flynn's corrosive suspicion meets du Maurier's romantic ambiguity. The domestic thriller where the danger is not knowing whether you are in danger."
    },
    {
      "id": "mys-domestic-thriller-002",
      "subgenre": "domestic-thriller",
      "authorA": "Patricia Highsmith",
      "authorB": "Dennis Lehane",
      "workX": "Deep Water",
      "workY": "Gone, Baby, Gone",
      "fromAuthorA": ["clinical detachment applied to marital horror — the husband who watches his wife's affairs with scientific calm", "violence as a private hobby: murder committed not from passion but from a kind of aesthetic preference", "the suburban surface maintained with psychopathic precision while the interior rots"],
      "fromAuthorB": ["the missing child case that reveals the moral architecture of an entire neighborhood", "working-class moral calculus — right and wrong determined by what you can live with, not what the law says", "the investigator who makes a choice at the end that is correct and catastrophic"],
      "fromWorkX": ["the marriage sustained by mutual contempt — each partner daring the other to leave", "the husband who begins killing his wife's lovers as a form of marital negotiation", "the snail farm: the protagonist's obsessive hobby as mirror for his methodical cruelty"],
      "fromWorkY": ["a child caught between terrible options, and the adults who must choose for her", "the neighborhood that closes ranks — loyalty as obstruction of justice", "the moral ending that satisfies no one: the right thing done for the right reasons, and everyone worse off"],
      "targetWordCount": 6200,
      "readingTimeMinutes": 25,
      "themes": "A school psychologist notices that a child in her care gives two mutually exclusive accounts of his home life — one idyllic, one terrifying — and both are delivered with equal conviction. Investigating, she finds the parents corroborate whichever story the child told most recently. Highsmith's clinical horror meets Lehane's moral devastation. The domestic thriller as epistemological crisis: a household where reality is negotiated daily, and the child has learned to survive by believing whatever version is safest."
    },
    {
      "id": "mys-whodunit-classic-001",
      "subgenre": "whodunit-classic",
      "authorA": "Agatha Christie",
      "authorB": "Arthur Conan Doyle",
      "workX": "The Murder of Roger Ackroyd",
      "workY": "A Study in Scarlet",
      "fromAuthorA": ["the narrator who is hiding in plain sight — the most radical misdirection in detective fiction", "village social dynamics as investigative terrain: gossip, reputation, and the unspoken rules of who may accuse whom", "deceptively warm, conversational prose that lulls the reader past the clues"],
      "fromAuthorB": ["the detective as outsider-genius whose methods are theatrical and whose reasoning is displayed like a magic trick", "the Watson figure: the narrator who admires, misunderstands, and inadvertently conceals", "forensic observation — the cigar ash, the mud on the boot, the physical world as text to be read"],
      "fromWorkX": ["the first-person narrator who is the murderer — trust weaponized", "the village doctor as investigator: respectable, trusted, above suspicion", "the twist that retroactively rewrites every scene the narrator described"],
      "fromWorkY": ["the flashback structure: a present-day murder solved by uncovering a past crime in a distant place", "revenge deferred across decades and continents — the motive that outlives geography", "the detective's first case: the introduction of a method, the proof of concept"],
      "targetWordCount": 7800,
      "readingTimeMinutes": 31,
      "themes": "A retired pathologist invited to consult on a poisoning at a country hotel dictates her observations to a young constable — and the reader slowly realizes her account of what happened and what the evidence shows are diverging in ways that only make sense if she saw something she is not reporting. Christie's narrator-as-suspect meets Doyle's deductive theater. The whodunit where the detective is also a witness, and the question is what she chose not to see."
    },
    {
      "id": "mys-whodunit-classic-002",
      "subgenre": "whodunit-classic",
      "authorA": "Daphne du Maurier",
      "authorB": "Dashiell Hammett",
      "workX": "Jamaica Inn",
      "workY": "The Thin Man",
      "fromAuthorA": ["Gothic atmosphere rendered through landscape — moors, rain, isolation as emotional states", "the female protagonist trapped in a hostile domestic space, gathering evidence while pretending not to", "romantic tension with a man who may be part of the crime she is trying to uncover"],
      "fromAuthorB": ["dialogue-driven scenes where what characters say and what they mean are never the same", "the detective couple: two minds working the same problem, one charming, one sharp", "stripped-down prose that trusts action and speech to carry meaning without interior commentary"],
      "fromWorkX": ["the inn on the moor: the isolated way-station where the crime is the business model", "the heroine who stumbles into a conspiracy and must pretend ignorance while gathering intelligence", "the uncle, the aunt, the vicar: each suspect occupying a fixed role in the community's economy of silence"],
      "fromWorkY": ["the missing inventor whose absence is more disruptive than his presence", "the social whirl as investigative cover — parties, dinners, and conversations where every guest is a suspect", "the married detectives whose banter is both affection and deduction, each testing the other's theories"],
      "targetWordCount": 4200,
      "readingTimeMinutes": 17,
      "themes": "A couple running a failing bed-and-breakfast on a remote peninsula discover that their most reliable guest — a birdwatcher who books the same room every autumn — has been found dead on the cliffs, and the coroner cannot determine whether he fell, jumped, or was pushed. Du Maurier's isolated Gothic meets Hammett's dry, dialogue-driven detection. The whodunit where the victim's routine was so precise that any deviation is a clue, and the couple's investigation is also a stress test of their marriage."
    },
    {
      "id": "mys-cozy-mystery-002",
      "subgenre": "cozy-mystery",
      "authorA": "Arthur Conan Doyle",
      "authorB": "Dennis Lehane",
      "workX": "The Adventure of the Blue Carbuncle",
      "workY": "A Drink Before the War",
      "fromAuthorA": ["the detective as eccentric genius who finds the extraordinary hidden inside the mundane", "the Christmas-story structure: goodwill, a goose, and a stolen jewel", "deductive reasoning applied to everyday objects — the hat that tells a man's entire life story"],
      "fromAuthorB": ["neighborhood loyalty and its costs — the community that knows everything and says nothing", "moral complexity in small-stakes settings: the petty crime that reveals structural injustice", "warmth and menace coexisting in the same street, the same conversation, the same family"],
      "fromWorkX": ["the found object that leads to a crime no one reported — the detective who investigates because he is curious, not because he is hired", "the chain of possession: goose to jewel to thief, each link a miniature character study", "mercy instead of justice: the detective who lets the criminal go because the lesson is sufficient"],
      "fromWorkY": ["the errand that escalates — a simple job that opens into a city's buried conflicts", "race and class as invisible infrastructure shaping who can go where and ask what", "the investigator who belongs to the neighborhood and therefore cannot be objective"],
      "targetWordCount": 3200,
      "readingTimeMinutes": 13,
      "themes": "A neighborhood librarian in a gentrifying district finds a collection of handwritten letters hidden inside a donated book — letters that document a decades-old property fraud still affecting families on her block. Doyle's deductive curiosity meets Lehane's neighborhood moral gravity. The cozy mystery where the crime is systemic, the clues are in the archive, and solving the case means deciding whose history gets to be official."
    },
    {
      "id": "mys-hardboiled-002",
      "subgenre": "hardboiled",
      "authorA": "Dashiell Hammett",
      "authorB": "Tana French",
      "workX": "Red Harvest",
      "workY": "Faithful Place",
      "fromAuthorA": ["spare, objective prose that strips away interiority — all action, all surface, the reader must supply the feeling", "the detective as agent of chaos: hired to clean up a town, he sets the factions against each other", "violence as currency — the only language the powerful actually understand"],
      "fromAuthorB": ["the return to a place that shaped you, now seen with adult eyes that recognize the damage", "family as crime scene: the secrets that bound you together are the ones destroying you", "atmospheric Dublin prose where the city's geography maps the narrator's psychology"],
      "fromWorkX": ["Poisonville — the company town so corrupt that the only solution is to let every faction destroy the others", "the Continental Op who arrives clean and leaves dirty, having used every dirty trick to accomplish something ambiguously good", "escalating violence where each act of 'justice' produces two more problems"],
      "fromWorkY": ["the detective who returns to his childhood street to investigate a cold case that is also his own story", "the family gathering that becomes an interrogation — every reunion is an accusation", "the dead woman who was the narrator's way out, and whose disappearance trapped him in the place he was trying to leave"],
      "targetWordCount": 4800,
      "readingTimeMinutes": 19,
      "themes": "A disgraced investigative journalist returns to the docklands neighborhood she escaped twenty years ago when her former source turns up dead in the same warehouse where they used to meet. Hammett's stripped-down violence meets French's psychological homecoming. Hardboiled as reunion: the case is the neighborhood, the suspects are everyone she grew up with, and the corruption she exposed in print is the same corruption that raised her."
    },
    {
      "id": "mys-psychological-thriller-003",
      "subgenre": "psychological-thriller",
      "authorA": "Daphne du Maurier",
      "authorB": "John le Carre",
      "workX": "Don't Look Now",
      "workY": "A Perfect Spy",
      "fromAuthorA": ["grief as perceptual distortion — the bereaved narrator who sees what isn't there, or sees too clearly", "Venice, Cornwall, Mediterranean settings rendered as psychological landscapes of dread", "the supernatural that may be psychological — the ambiguity never resolved, the reader never safe"],
      "fromAuthorB": ["the double life as identity dissolution — the spy who has performed so many roles he cannot find the original", "autobiography as espionage: the memoir that is also a confession, also a final betrayal", "moral exhaustion rendered through dense, recursive prose — sentences that circle their subjects like surveillance"],
      "fromWorkX": ["the red-coated figure glimpsed in Venice — grief hallucinated into presence", "the psychic warning that the protagonist ignores because rationality is his defense against loss", "the twist ending that reframes the entire story as a trap the protagonist walked into because he could not stop looking for what he had lost"],
      "fromWorkY": ["the perfect spy as the perfect son: loyalty as performance, love as cover", "the father as con man — the child raised inside a lie who learns deception as mother tongue", "the confession that is not repentance but one final, exquisite manipulation"],
      "targetWordCount": 9400,
      "readingTimeMinutes": 38,
      "themes": "A translator working in a foreign embassy begins receiving letters in her dead husband's handwriting — letters that contain accurate intelligence about her colleagues. Du Maurier's grief-as-perception meets le Carre's identity dissolution. The psychological thriller where the protagonist cannot determine whether she is being manipulated by a living person using her husband's hand, or whether her grief has become so precise it now generates information she could not otherwise know."
    }
  ]
}
