{
  "genre": "romance",
  "generatedDate": "2026-02-21",
  "combinations": [
    {
      "id": "rom-paranormal-romance-001",
      "subgenre": "paranormal-romance",
      "authorA": "Nora Roberts",
      "authorB": "Carmen Maria Machado",
      "workX": "Dark Witch",
      "workY": "Her Body and Other Parties",
      "fromAuthorA": ["propulsive, emotionally direct storytelling with dual perspectives", "strong-willed heroines who lead with competence", "romantic tension built through action and shared danger"],
      "fromAuthorB": ["surreal, queer, formally inventive horror-inflected prose", "the body as site of terror and desire simultaneously", "fairy-tale structures where the rules shift beneath the characters"],
      "fromWorkX": ["inherited magical power awakening through place and bloodline", "a woman returning to ancestral land to claim a legacy she barely understands", "the coven as found family — collective magic stronger than individual"],
      "fromWorkY": ["desire that physically transforms the desiring body", "the inventory of a woman's experiences rendered as fable", "love stories nested inside horror stories — intimacy as both refuge and threat"],
      "targetWordCount": 4800,
      "readingTimeMinutes": 19,
      "themes": "Roberts's propulsive romantic certainty collides with Machado's uncanny body-horror sensibility. A paranormal romance where a woman inherits her grandmother's ability to feel others' emotions through touch — and falls for someone whose emotional landscape is genuinely alien. Roberts drives the love story forward; Machado keeps asking what it costs a body to feel that much."
    },
    {
      "id": "rom-paranormal-romance-002",
      "subgenre": "paranormal-romance",
      "authorA": "Alyssa Cole",
      "authorB": "Angela Carter",
      "workX": "A Princess in Theory",
      "workY": "The Bloody Chamber",
      "fromAuthorA": ["genre-blending romance with sharp political awareness", "protagonists who are practical, skeptical, and deeply competent", "diverse settings rendered with specificity rather than exoticism"],
      "fromAuthorB": ["lush, baroque, feminist Gothic prose", "fairy tales rewritten through desire and power", "the monstrous beloved — attraction to what should repel"],
      "fromWorkX": ["the hidden identity revealed — a prince disguised in the ordinary world", "a skeptical woman forced to reconsider everything she knows about her origins", "two worlds colliding: the mundane and the extraordinary"],
      "fromWorkY": ["the locked room containing the beloved's true nature", "curiosity as transgression — the heroine who opens the forbidden door", "blood and roses — violence aestheticized then interrogated"],
      "targetWordCount": 5400,
      "readingTimeMinutes": 22,
      "themes": "Cole's clear-eyed pragmatism meets Carter's Gothic excess. A paranormal romance where a no-nonsense epidemiologist discovers that the man she's been dating is not human — and the revelation is not a betrayal but an invitation into a world where desire operates by older, stranger rules. Cole grounds the heroine in science; Carter makes the supernatural seduction genuinely dangerous and genuinely beautiful."
    },
    {
      "id": "rom-paranormal-romance-003",
      "subgenre": "paranormal-romance",
      "authorA": "Beverly Jenkins",
      "authorB": "Neil Gaiman",
      "workX": "Breathless",
      "workY": "The Ocean at the End of the Lane",
      "fromAuthorA": ["rich historical romance grounded in African American community and pride", "heroines who carry themselves with dignity and quiet power", "love that happens within and because of community, not despite it"],
      "fromAuthorB": ["matter-of-fact prose amid the fantastical", "myth made accessible through mundane, specific detail", "dark whimsy where enchantment has real consequences"],
      "fromWorkX": ["a woman arriving in a new town to start over, discovering more than she expected", "romance that grows from mutual respect and shared labor", "the frontier as place of reinvention and belonging"],
      "fromWorkY": ["ancient, feminine supernatural power dwelling just beneath the ordinary", "a door opened in childhood that never fully closes", "memory and forgetting as the price of contact with the otherworldly"],
      "targetWordCount": 6200,
      "readingTimeMinutes": 25,
      "themes": "Jenkins's community-rooted warmth meets Gaiman's mythic strangeness. A paranormal romance set in a Black township in the 1890s, where a schoolteacher falls for a quiet blacksmith who carries something old and inhuman inside him — not as curse but as inheritance. Jenkins keeps the love story grounded in community, church suppers, and the politics of respectability; Gaiman ensures the supernatural is never tame."
    },
    {
      "id": "rom-romantasy-001",
      "subgenre": "romantasy",
      "authorA": "Lisa Kleypas",
      "authorB": "Robin Hobb",
      "workX": "Devil in Winter",
      "workY": "Royal Assassin",
      "fromAuthorA": ["sensual, atmospheric prose with emotional intensity", "the rake reformed through genuine vulnerability, not just attraction", "social worlds rendered with warmth and texture"],
      "fromAuthorB": ["deep psychological interiority and slow-burn emotional devastation", "the animal-bond as metaphor for wordless intimacy", "loyalty to a system that does not deserve it"],
      "fromWorkX": ["a marriage of convenience that becomes devastatingly real", "a woman who appears fragile using her intelligence as her sharpest weapon", "the gambling hell as arena — risk as metaphor for emotional exposure"],
      "fromWorkY": ["duty and love as mutually exclusive demands on the protagonist", "court politics where affection is a weapon others will use", "the assassin who loves the thing they are ordered to protect"],
      "targetWordCount": 7200,
      "readingTimeMinutes": 29,
      "themes": "Kleypas's sensual warmth meets Hobb's devastating interiority. A romantasy where a court healer is bonded by magic to the king's spymaster — a bond neither chose, which transmits not just emotion but physical sensation. Kleypas drives the attraction; Hobb ensures the intimacy is as terrifying as it is desired. The political stakes demand they use the bond as a weapon; the personal stakes demand they stop pretending it is only a tool."
    },
    {
      "id": "rom-romantasy-002",
      "subgenre": "romantasy",
      "authorA": "Cat Sebastian",
      "authorB": "Madeline Miller",
      "workX": "Unmasked by the Marquess",
      "workY": "The Song of Achilles",
      "fromAuthorA": ["queer romance built through precise, restrained emotional beats", "protagonists defined by what they have sacrificed or hidden", "tenderness deployed through understatement"],
      "fromAuthorB": ["classical, elevated prose with modern emotional intelligence", "mythological reimagining centering interiority over action", "love as the force that outlasts gods and wars"],
      "fromWorkX": ["a character living under a false identity to survive", "romance that requires the beloved to see through the disguise", "gender performance as both prison and liberation"],
      "fromWorkY": ["love between a mortal and a figure of mythic destiny", "the beloved who will be remembered forever and the one who will be forgotten", "war as the force that tests whether love is real or convenient"],
      "targetWordCount": 6800,
      "readingTimeMinutes": 27,
      "themes": "Sebastian's restrained queer tenderness meets Miller's mythic grandeur. A romantasy where a mortal soldier falls for a war-mage whose power is prophesied — and the prophecy says nothing about the soldier at all. Sebastian keeps the romance in small, devastating gestures; Miller gives the world the weight of myth. The question is whether a love story can survive being footnoted by destiny."
    },
    {
      "id": "rom-romantasy-003",
      "subgenre": "romantasy",
      "authorA": "Courtney Milan",
      "authorB": "N.K. Jemisin",
      "workX": "The Governess Affair",
      "workY": "The Fifth Season",
      "fromAuthorA": ["sharp feminist romance with intellectual combativeness", "protagonists whose intelligence is their primary weapon", "emotional warmth built through vulnerability, not spectacle"],
      "fromAuthorB": ["inventive second-person and present-tense narration", "worldbuilding rooted in systemic oppression and survival", "emotional rawness that refuses sentimentality"],
      "fromWorkX": ["a woman using patience and stubbornness as weapons against a powerful man", "the heroine who refuses to move — presence as protest", "romance between people on opposite sides of a power imbalance"],
      "fromWorkY": ["a world that periodically destroys itself and the people who endure it", "power that makes you feared by the people you protect", "motherhood under conditions of state violence"],
      "targetWordCount": 5600,
      "readingTimeMinutes": 22,
      "themes": "Milan's feminist precision meets Jemisin's systemic fury. A romantasy where a woman with earth-shaping magic is sold into a political marriage meant to neutralize her — and her husband-to-be is the scholar assigned to study how to suppress her power. Milan insists the love story requires genuine equality; Jemisin insists the system will never grant it. The romance becomes an argument about whether two people can build something real inside an institution designed to destroy one of them."
    },
    {
      "id": "rom-romantic-suspense-001",
      "subgenre": "romantic-suspense",
      "authorA": "Nora Roberts",
      "authorB": "Tana French",
      "workX": "The Witness",
      "workY": "The Likeness",
      "fromAuthorA": ["propulsive dual-perspective storytelling that never loses emotional throughline", "heroines defined by competence under pressure", "romantic tension woven through external danger"],
      "fromAuthorB": ["atmospheric, psychologically rich prose steeped in place", "identity dissolving under the pressure of investigation", "Dublin weather as emotional barometer"],
      "fromWorkX": ["a woman in hiding whose past is hunting her", "the methodical construction of a new identity over years", "love arriving as a threat to the safety of anonymity"],
      "fromWorkY": ["an investigator who assumes a dead person's identity to solve a case", "the found-family commune that harbors violence beneath warmth", "the seduction of becoming someone else — identity as the real mystery"],
      "targetWordCount": 5200,
      "readingTimeMinutes": 21,
      "themes": "Roberts's propulsive romantic drive meets French's atmospheric psychological depth. A romantic suspense where a woman who fled an abusive family and rebuilt herself under a new name falls for a detective investigating a death connected to her old life. Roberts keeps the romance urgent and the heroine strong; French ensures the suspense is psychological — the real danger is not what her family might do but what being found would do to the person she has become."
    },
    {
      "id": "rom-romantic-suspense-002",
      "subgenre": "romantic-suspense",
      "authorA": "Alyssa Cole",
      "authorB": "Gillian Flynn",
      "workX": "When No One Is Watching",
      "workY": "Gone Girl",
      "fromAuthorA": ["genre-blending romance with sharp political awareness", "diverse settings rendered with cultural specificity", "protagonists who are observant, skeptical, and resourceful"],
      "fromAuthorB": ["sharp, venomous wit deployed through unreliable narration", "the darkness beneath domestic surfaces", "marriage as crime scene — intimacy weaponized"],
      "fromWorkX": ["gentrification as thriller — the neighborhood disappearing around the protagonist", "community history as the clue that unlocks the conspiracy", "the couple who investigate together and discover they cannot fully trust each other"],
      "fromWorkY": ["the diary that lies — a narrative within the narrative designed to deceive", "the cool girl performance and its eventual, spectacular collapse", "love that might be a long con — and the uncertainty of never fully knowing"],
      "targetWordCount": 4200,
      "readingTimeMinutes": 17,
      "themes": "Cole's political sharpness meets Flynn's domestic venom. A romantic suspense where two neighbors in a rapidly gentrifying neighborhood start an affair while investigating why longtime residents keep vanishing — and each suspects the other may be involved. Cole brings the systemic critique; Flynn brings the poisoned intimacy. The romance is real, but neither lover can be certain the other isn't performing."
    },
    {
      "id": "rom-erotic-romance-001",
      "subgenre": "erotic-romance",
      "authorA": "Lisa Kleypas",
      "authorB": "Anaïs Nin",
      "workX": "Married by Morning",
      "workY": "Delta of Venus",
      "fromAuthorA": ["sensual, atmospheric prose building emotional intensity through physical detail", "the slow burn that earns its payoff through accumulated tension", "emotional vulnerability revealed through physical intimacy"],
      "fromAuthorB": ["lyrical, dreamlike prose treating desire as artistic subject", "eroticism rendered through metaphor and sensory accumulation", "the female gaze on desire — interiority during physical experience"],
      "fromWorkX": ["enemies forced into proximity by legal circumstance", "the argument that becomes something else — intellectual sparring as foreplay", "a practical arrangement that dismantles both parties' defenses"],
      "fromWorkY": ["desire as a landscape to be explored — geography of the body", "connected vignettes building a mosaic of intimacy", "the unnamed — longing articulated through what is felt, not labeled"],
      "targetWordCount": 3800,
      "readingTimeMinutes": 15,
      "themes": "Kleypas's emotional architecture meets Nin's lyrical eroticism. An erotic romance between a divorce attorney and her opposing counsel, locked in a week-long settlement negotiation at a remote estate. Kleypas provides the enemies-to-lovers structure and the emotional stakes beneath the physical; Nin ensures the erotic scenes are rendered as art — not choreography but interior experience, the way desire rewrites a person's relationship to their own body."
    },
    {
      "id": "rom-erotic-romance-002",
      "subgenre": "erotic-romance",
      "authorA": "Talia Hibbert",
      "authorB": "Virginia Woolf",
      "workX": "Get a Life, Chloe Brown",
      "workY": "Orlando",
      "fromAuthorA": ["witty, neurodivergent-affirming romance with emotional honesty", "heroines whose relationship to their own bodies is complicated and real", "British settings with wry warmth that never sentimentalizes"],
      "fromAuthorB": ["luminous interiority where consciousness flows through sensation and memory", "time experienced as subjective — a moment expanding into pages", "the fluid self — identity as performance and becoming"],
      "fromWorkX": ["a heroine with chronic pain learning to inhabit her body on her own terms", "a bucket list as narrative engine — choosing to want things again", "the building superintendent as unexpected love interest — proximity and class"],
      "fromWorkY": ["gender and desire as fluid, shifting, historically contingent", "centuries of experience collapsed into a single consciousness", "the love letter to a specific person that becomes universal"],
      "targetWordCount": 5000,
      "readingTimeMinutes": 20,
      "themes": "Hibbert's embodied, witty warmth meets Woolf's luminous interiority. An erotic romance where a woman with chronic pain and a partner who experiences sensation differently discover each other's bodies as foreign countries worth learning. Hibbert grounds it in humor, specificity, and the reality of a body that doesn't cooperate; Woolf elevates the intimate scenes into something prismatic — consciousness expanding inside a single touch."
    },
    {
      "id": "rom-contemporary-romance-002",
      "subgenre": "contemporary-romance",
      "authorA": "Nora Roberts",
      "authorB": "Chimamanda Ngozi Adichie",
      "workX": "Vision in White",
      "workY": "Americanah",
      "fromAuthorA": ["propulsive, emotionally direct storytelling with strong romantic throughline", "heroines who build careers and relationships with equal determination", "the group of close female friends as emotional infrastructure"],
      "fromAuthorB": ["precise, luminous realism with cultural duality at its center", "warmth laced with political edge — the personal is always political", "the immigrant experience rendered without sentimentality or reduction"],
      "fromWorkX": ["a wedding photography business — seeing others' love stories while doubting your own", "female friendship as the real foundation beneath the romance", "creative work as emotional labor — making other people's perfect moments"],
      "fromWorkY": ["a transatlantic love story tested by distance, culture, and identity", "the blog as confessional voice — performing honesty in public", "returning home and finding you no longer fit — displacement as permanent condition"],
      "targetWordCount": 4400,
      "readingTimeMinutes": 18,
      "themes": "Roberts's romantic propulsion meets Adichie's cultural precision. A contemporary romance between a Nigerian-born event planner in New York and a chef who left Lagos to prove something and now cannot go back. Roberts drives the love story with her signature certainty; Adichie ensures the cultural displacement is not a backdrop but the central obstacle — not just 'will they get together' but 'which version of themselves will they be when they do.'"
    },
    {
      "id": "rom-historical-romance-002",
      "subgenre": "historical-romance",
      "authorA": "Beverly Jenkins",
      "authorB": "Jane Austen",
      "workX": "Indigo",
      "workY": "Pride and Prejudice",
      "fromAuthorA": ["meticulous historical research centering Black American experience", "heroines who carry themselves with dignity amid systemic hostility", "community as the ground from which love grows — not isolated passion but embedded belonging"],
      "fromAuthorB": ["ironic, precise social comedy where wit is both weapon and courtship tool", "free indirect discourse revealing the gap between social performance and private feeling", "the marriage plot as economic and political negotiation"],
      "fromWorkX": ["a love story set against the Underground Railroad — danger as backdrop to tenderness", "the safe house as crucible — strangers forced into intimacy by shared peril", "historical specificity that refuses to soften the era's violence"],
      "fromWorkY": ["first impressions proved wrong — the beloved who seems impossible at first", "the long letter that rewrites everything the heroine thought she knew", "pride and prejudice as mutual flaws that must be overcome simultaneously"],
      "targetWordCount": 7500,
      "readingTimeMinutes": 30,
      "themes": "Jenkins's historical depth meets Austen's social comedy. A historical romance set in 1850s Ohio, where a free Black woman running a millinery shop clashes with a newly arrived abolitionist minister whose Northern propriety she finds insufferable — and whose sermons she finds secretly electrifying. Jenkins brings the period detail and the stakes; Austen brings the structure of mutual misjudgment slowly, deliciously corrected."
    },
    {
      "id": "rom-queer-romance-002",
      "subgenre": "queer-romance",
      "authorA": "Casey McQuiston",
      "authorB": "Oscar Wilde",
      "workX": "Red, White & Royal Blue",
      "workY": "The Importance of Being Earnest",
      "fromAuthorA": ["exuberant queer rom-com voice with pop-culture fluency", "optimistic, millennial sensibility that insists on joy", "the public figure whose private self is the real person"],
      "fromAuthorB": ["epigrammatic wit where every line is quotable", "paradox as worldview — surfaces conceal depths that conceal more surfaces", "the comedy of performing an identity that turns out to be true"],
      "fromWorkX": ["a public rivalry masking private attraction between high-profile figures", "coming out as political act — the personal becoming inescapably public", "the leaked evidence of a secret relationship"],
      "fromWorkY": ["a double life maintained through elaborate fabrication", "the invented persona that becomes more real than the original", "a play where everyone is performing sincerity and the performance becomes genuine"],
      "targetWordCount": 3400,
      "readingTimeMinutes": 14,
      "themes": "McQuiston's queer exuberance meets Wilde's epigrammatic sophistication. A queer romance between a young diplomat and a society columnist who has been writing blind items about him — each performing a public version of themselves while hiding who they actually want. McQuiston brings the earnest joy; Wilde brings the structural irony. The comedy is that the masks they wear to hide turn out to be their real faces."
    },
    {
      "id": "rom-romantic-comedy-002",
      "subgenre": "romantic-comedy",
      "authorA": "Jane Austen",
      "authorB": "Nora Ephron",
      "workX": "Emma",
      "workY": "When Harry Met Sally",
      "fromAuthorA": ["ironic narrative voice that knows more than its heroine", "matchmaking as proxy for the protagonist's own unexamined desires", "the comedy of self-deception — a brilliant woman blind to herself"],
      "fromAuthorB": ["sharp observational wit grounded in the comedy of modern womanhood", "the long friendship that everyone sees as a love story except the two people in it", "New York as romantic character — the city of reinvention"],
      "fromWorkX": ["the compulsive matchmaker who cannot see her own match", "the slow realization that the right person has been there all along", "the heroine's education — not in love but in self-knowledge"],
      "fromWorkY": ["the 'can men and women be friends' question explored through years", "the montage of near-misses and wrong timing", "the declaration that comes not from passion but from finally understanding"],
      "targetWordCount": 3200,
      "readingTimeMinutes": 13,
      "themes": "Austen's social irony meets Ephron's modern romantic wit. A romantic comedy about a food critic who keeps setting up her best friend with the wrong people — while her co-critic (and longtime sparring partner) watches the disasters unfold with increasingly pointed commentary. Austen provides the structure of comic self-deception; Ephron provides the snappy dialogue and the moment it all stops being funny and becomes real."
    },
    {
      "id": "rom-erotic-romance-003",
      "subgenre": "erotic-romance",
      "authorA": "Jane Austen",
      "authorB": "Toni Morrison",
      "workX": "Sense and Sensibility",
      "workY": "Jazz",
      "fromAuthorA": ["ironic restraint — what is felt intensely but expressed through social code", "the tension between sense and sensibility as two ways of loving", "free indirect discourse revealing the gap between composure and chaos"],
      "fromAuthorB": ["lyrical, incantatory prose that moves to jazz rhythms", "desire as historical force — the body remembering what the mind suppresses", "the city as a living, seductive presence that changes everyone who arrives"],
      "fromWorkX": ["two sisters embodying opposite philosophies of desire — restraint vs. abandon", "the betrayal that tests whether love survives disappointment", "the slow, agonizing recalibration of expectations"],
      "fromWorkY": ["Harlem as erotic geography — music, nightclubs, and rooftops as sites of desire", "the affair that ruptures a marriage and the reconstruction that follows", "the narrator who addresses the reader directly about love's dangers"],
      "targetWordCount": 4600,
      "readingTimeMinutes": 18,
      "themes": "Austen's controlled irony meets Morrison's lyrical heat. An erotic romance about two women — one buttoned-up, one reckless — navigating desire in a city that offers everything and forgives nothing. Austen provides the architecture of restraint and the comedy of propriety; Morrison provides the prose rhythms of a body that will not be governed by propriety. The erotic content emerges from the collision: what happens when someone who has never let herself want finally does."
    }
  ]
}
