{
  "genre": "western",
  "generatedDate": "2026-02-21",
  "combinations": [
    {
      "id": "wst-classic-traditional-001",
      "subgenre": "classic-traditional",
      "authorA": "Louis L'Amour",
      "authorB": "Dorothy M. Johnson",
      "workX": "Shane",
      "workY": "True Grit",
      "fromAuthorA": ["authentic, immersive frontier prose — sagebrush-and-leather tactile detail", "action-driven narrative with laconic dialogue", "the loner who rides in, solves the problem, and rides out"],
      "fromAuthorB": ["economical, powerful short fiction — not a wasted word", "the myth and the reality existing in the same sentence", "ordinary people caught in the machinery of Western violence"],
      "fromWorkX": ["the mysterious stranger who brings salvation and destruction in equal measure", "the child narrator witnessing adult violence they cannot fully comprehend", "the gunfight as ritual — the moment the West demanded and the West regretted"],
      "fromWorkY": ["the quest for justice narrated by an unshakeable voice", "frontier law as personal covenant, not institutional system", "the unlikely partnership forged by shared purpose and mutual stubbornness"],
      "targetWordCount": 4600,
      "readingTimeMinutes": 18,
      "themes": "L'Amour's frontier authenticity meets Johnson's compressed power. A classic Western where the stranger arrives in a town with a problem only violence can solve — but Johnson's influence refuses to let the violence be clean. L'Amour gives us the dust, the leather, the economy of the draw; Johnson gives us the widow who has to live in the town after the stranger leaves."
    },
    {
      "id": "wst-classic-traditional-002",
      "subgenre": "classic-traditional",
      "authorA": "Charles Portis",
      "authorB": "Louis L'Amour",
      "workX": "Lonesome Dove",
      "workY": "The Virginian",
      "fromAuthorA": ["deadpan comic voice with colloquial precision", "narrators who are smarter than they let on", "understated mastery — the funny surface concealing emotional depths"],
      "fromAuthorB": ["authentic frontier prose immersed in the physical textures of the West", "action sequences with clean, efficient choreography", "the code of the West as lived practice, not abstract philosophy"],
      "fromWorkX": ["the great cattle drive as last hurrah — one final ride before the world changes", "the friendship between two aging cowboys who cannot say what they mean", "the West as elegy — the story of something ending"],
      "fromWorkY": ["the tenderfoot transformed by the frontier into something harder", "the hanging as moral test — when the code demands killing a friend", "the courtship conducted across the civilized-wild divide"],
      "targetWordCount": 7500,
      "readingTimeMinutes": 30,
      "themes": "Portis's deadpan wit meets L'Amour's frontier authenticity. A traditional Western with a narrator whose dry comic voice keeps undercutting the heroics — not mocking them, but refusing to let them be solemn. Two old hands on a last job, Portis keeping the dialogue wry and L'Amour keeping the landscape real, while the story quietly becomes an elegy for a friendship that neither man has the vocabulary to name."
    },
    {
      "id": "wst-weird-western-001",
      "subgenre": "weird-western",
      "authorA": "Cormac McCarthy",
      "authorB": "Shirley Jackson",
      "workX": "Blood Meridian",
      "workY": "The Haunting of Hill House",
      "fromAuthorA": ["sparse, biblical prose without quotation marks", "mythic violence rendered as liturgy — killing as cosmic principle", "the border as moral abyss where civilization's categories dissolve"],
      "fromAuthorB": ["domestic spaces made menacing through precise, unsettling prose", "the horror of conformity and belonging", "psychological precision — the narrator who cannot trust their own perception"],
      "fromWorkX": ["the scalp-hunting expedition as descent into hell", "the judge as embodiment of war's eternal, supernatural nature", "a journey that strips away every civilized pretension to reveal what's underneath"],
      "fromWorkY": ["the house that is alive — architecture as malevolent intelligence", "the group of investigators slowly consumed by the thing they study", "the invitation that is also a trap — choosing to enter what cannot be escaped"],
      "targetWordCount": 5800,
      "readingTimeMinutes": 23,
      "themes": "McCarthy's biblical violence meets Jackson's psychological horror. A weird Western where a posse pursues something across the desert that should not exist — and the landscape itself begins to exhibit intention. McCarthy provides the merciless terrain and the prose that treats horror as sacrament; Jackson provides the creeping realization that the hunters have been invited, and the thing they're hunting is the territory itself."
    },
    {
      "id": "wst-literary-western-001",
      "subgenre": "literary-western",
      "authorA": "Oakley Hall",
      "authorB": "Marilynne Robinson",
      "workX": "Warlock",
      "workY": "Housekeeping",
      "fromAuthorA": ["literary Western prose with moral ambiguity baked into every choice", "the frontier town as political arena — faction against faction", "revisionist myth-making: the lawman, the outlaw, and the citizens who need both"],
      "fromAuthorB": ["meditative, theological prose with radiant attention to ordinary life", "long, cadenced sentences that make isolation feel inhabited", "the Western landscape as spiritual geography — not backdrop but argument"],
      "fromWorkX": ["the town marshal as necessary violence the town will later deny needing", "the duality of lawman and outlaw as two faces of the same function", "frontier justice as compromise between what's right and what's survivable"],
      "fromWorkY": ["transience as way of life — the refusal to be domesticated", "the house at the edge of the lake — dwelling at the margin of civilization", "two women choosing wilderness over the social contract"],
      "targetWordCount": 6800,
      "readingTimeMinutes": 27,
      "themes": "Hall's revisionist frontier morality meets Robinson's theological attention. A literary Western where the town's crisis is not a bandit but a question: what kind of place do we want to be? Hall provides the political complexity — every faction has reasons, every solution has costs; Robinson provides the prose that treats a single afternoon of light on a dirt street as revelation. The West as moral landscape, not adventure setting."
    },
    {
      "id": "wst-frontier-pioneer-001",
      "subgenre": "frontier-pioneer",
      "authorA": "Annie Proulx",
      "authorB": "Larry McMurtry",
      "workX": "My Ántonia",
      "workY": "Little House on the Prairie",
      "fromAuthorA": ["brutal, compressed, landscape-saturated prose — the West as unforgiving", "the body broken by the land it tries to cultivate", "stories that end not with resolution but with weather"],
      "fromAuthorB": ["elegiac, character-rich storytelling — warmth laced with loss", "the death of the Old West rendered through the people who lived it", "dialogue that carries whole biographies in a few lines"],
      "fromWorkX": ["the immigrant homesteader whose labor builds a world from grass", "the prairie as both freedom and prison — nothing between you and the horizon", "the narrator looking back at a life that was harder and more real than anything that followed"],
      "fromWorkY": ["the family as smallest viable unit of civilization", "the seasonal cycle as narrative structure — planting, growing, surviving winter", "the practical details of making a home from raw land — what you eat, what you burn, what you fear"],
      "targetWordCount": 5200,
      "readingTimeMinutes": 21,
      "themes": "Proulx's brutal compression meets McMurtry's elegiac warmth. A frontier narrative about a family homesteading land that does not want them — Proulx delivering the physical toll of every day (the broken axle, the well that goes dry, the child's fever) while McMurtry insists on the tenderness that survives it. A story where making a home is the adventure, and the antagonist is the distance between what was imagined and what is endured."
    },
    {
      "id": "wst-outlaw-narrative-001",
      "subgenre": "outlaw-narrative",
      "authorA": "Elmore Leonard",
      "authorB": "Cormac McCarthy",
      "workX": "Butch Cassidy and the Sundance Kid",
      "workY": "No Country for Old Men",
      "fromAuthorA": ["snappy dialogue and lean prose — criminals with personality and timing", "the Western-to-crime pipeline: outlaws as professionals", "humor as survival mechanism — the joke that keeps you human while doing inhuman things"],
      "fromAuthorB": ["sparse, unpunctuated prose treating violence as geology — impersonal, inevitable", "the border as moral void where consequences finally arrive", "the antagonist who operates by a logic more consistent than the law's"],
      "fromWorkX": ["the outlaw duo whose partnership is the real story", "the law closing in — the shrinking territory of the free", "the Bolivia gambit: running until there's nowhere left to run"],
      "fromWorkY": ["the unstoppable pursuer — fate with a weapon", "the money that poisons everything it touches", "the old lawman who recognizes the world has outgrown his understanding"],
      "targetWordCount": 4200,
      "readingTimeMinutes": 17,
      "themes": "Leonard's wisecracking criminal energy meets McCarthy's implacable violence. An outlaw narrative where the banter is the last wall between the protagonists and the thing pursuing them — Leonard giving the outlaws their humanity through dialogue while McCarthy gives the pursuer a silence that makes the jokes sound increasingly desperate. The West as a closing trap, the partnership as the only thing worth preserving, and the question of whether charm is enough to outrun fate."
    },
    {
      "id": "wst-border-western-001",
      "subgenre": "border-western",
      "authorA": "Philipp Meyer",
      "authorB": "Tommy Orange",
      "workX": "All the Pretty Horses",
      "workY": "The House on Mango Street",
      "fromAuthorA": ["multi-generational Texas brutality — empire-building and its costs", "unflinching, kinetic prose that implicates the reader in the violence", "land as contested inheritance — who owns what was stolen"],
      "fromAuthorB": ["polyphonic structure — multiple voices constructing a single community portrait", "the contemporary frontier: urban, Indigenous, displaced", "Oakland/reservation as the new borderland — between cultures, between eras"],
      "fromWorkX": ["the young man crossing into Mexico and discovering the West he idealized doesn't exist", "the ranch as lost Eden — the pastoral dream tested by border reality", "imprisonment and violence as the border's true curriculum"],
      "fromWorkY": ["the neighborhood as entire world — each house a story, each story a border", "the child narrator absorbing a community's history through fragments", "the promise of leaving and the gravity of belonging"],
      "targetWordCount": 5600,
      "readingTimeMinutes": 22,
      "themes": "Meyer's imperial brutality meets Orange's polyphonic displacement. A border Western told in multiple voices from both sides of a line that means different things to everyone who crosses it — the rancher whose family took the land, the worker whose family was on it first, the coyote who profits from both. Meyer provides the violence of the border's history; Orange provides the chorus of the people living in its present."
    },
    {
      "id": "wst-neo-western-002",
      "subgenre": "neo-western",
      "authorA": "Cormac McCarthy",
      "authorB": "Elmore Leonard",
      "workX": "Hell or High Water",
      "workY": "Winter's Bone",
      "fromAuthorA": ["sparse, biblical prose — the modern West as moral vacuum", "landscape as character — the desert, the highway, the emptied town", "violence arriving with the inevitability of weather"],
      "fromAuthorB": ["lean, dialogue-driven prose with dark humor", "criminals as working people — the heist as blue-collar labor", "snappy pacing that treats the reader's attention as sacred"],
      "fromWorkX": ["the bank robbery as class warfare — robbing the institution that robbed you", "the brother partnership: one careful, one reckless", "the retiring lawman pursuing one last case across dying small towns"],
      "fromWorkY": ["rural poverty as the setting crime emerges from — not chosen but inherited", "the family obligation that pulls the protagonist into danger", "the Ozarks/West as a place where asking questions is more dangerous than the answers"],
      "targetWordCount": 3400,
      "readingTimeMinutes": 14,
      "themes": "McCarthy's mythic desolation meets Leonard's blue-collar crime energy. A neo-Western where a ranch family's desperation leads to a plan that is half bank robbery, half act of revenge against the system — Leonard keeping the planning scenes taut and darkly funny while McCarthy makes the landscape remind you that this land has eaten every plan anyone ever made on it."
    },
    {
      "id": "wst-revisionist-002",
      "subgenre": "revisionist",
      "authorA": "Dorothy M. Johnson",
      "authorB": "Oakley Hall",
      "workX": "Little Big Man",
      "workY": "Killers of the Flower Moon",
      "fromAuthorA": ["economical, devastating short fiction — the Western myth tested against its costs", "ordinary people inside extraordinary violence", "the story behind the legend — what the dime novel left out"],
      "fromAuthorB": ["literary Western with political complexity — no side is clean", "the frontier town as arena of competing interests", "revisionist myth-making that doesn't replace old lies with new ones"],
      "fromWorkX": ["the white man raised by Native Americans — the border between cultures as lived experience", "the unreliable old narrator whose tall tales contain buried truths", "the massacre as the event the West built itself on and refuses to see"],
      "fromWorkY": ["the systematic murder of the Osage — genocide for oil money", "institutional betrayal — the law that was supposed to protect enabling the killing", "the crime that required a whole town's complicity to sustain"],
      "targetWordCount": 8900,
      "readingTimeMinutes": 36,
      "themes": "Johnson's devastating compression meets Hall's political complexity. A revisionist Western that tells the same event twice — once as the town remembers it, once as it happened. Johnson provides the economical, unflinching prose that makes a single gunshot carry the weight of a whole community's choice; Hall provides the web of interests, silences, and convenient forgetfulness that allowed the official version to calcify into legend."
    },
    {
      "id": "wst-weird-western-002",
      "subgenre": "weird-western",
      "authorA": "Charles Portis",
      "authorB": "Carmen Maria Machado",
      "workX": "The Dark Tower: The Gunslinger",
      "workY": "The Power of the Dog",
      "fromAuthorA": ["deadpan comic voice reporting the impossible with straight-faced precision", "colloquial narrators who are weirder than they realize", "understated mastery — absurdity presented as fact"],
      "fromAuthorB": ["surreal, formally inventive fiction where the body is the site of transformation", "fairy-tale structures applied to contemporary horror", "queer sensibility disrupting genre expectations from within"],
      "fromWorkX": ["the gunslinger pursuing the man in black across a desert that is also a wasteland between worlds", "the Western as post-apocalyptic landscape — genre as ruin", "the tower as unreachable destination that justifies every cruelty along the way"],
      "fromWorkY": ["the drug war as Western — cartels as cattle barons, agents as marshals", "loyalty and betrayal cycling across decades", "the border as a place where reality itself becomes negotiable"],
      "targetWordCount": 7100,
      "readingTimeMinutes": 28,
      "themes": "Portis's deadpan absurdism meets Machado's surreal body-horror. A weird Western narrated by someone who reports the uncanny — the town that wasn't there yesterday, the preacher whose shadow moves independently, the well that answers questions — with the same flat, precise voice they'd use to describe a horse trade. Portis keeps the surface funny; Machado makes what's underneath the surface genuinely unsettling."
    }
  ]
}
