{
  "workSlug": "the-season-of-your-return",
  "reviews": [
    {
      "personaId": "sf-001-tunde",
      "rating": 4,
      "text": "The geological compliance bureau feels like a real institution — the kind of bureaucratic machinery that African cities actually build when they outgrow colonial infrastructure. Dara's displacement between the monitoring station and the tunnel is handled with restraint; the prose never oversells the horror. What makes this work is the specificity: the borehole survey grid, the clay tablets, the hand-smelted iron rod. You can feel the research. The Sullivan dynasty is maybe too on-the-nose, but the central conceit — that the enslaved surveyors' knowledge was laundered through academic papers — is devastating and probably not far from the truth.",
      "date": "2025-12-14",
      "helpfulCount": 34
    },
    {
      "personaId": "sf-002-helen",
      "rating": 5,
      "text": "I have been reading science fiction for forty years and this is the first time a story made me feel the weight of a sledgehammer in my own hands. The second-person narration could so easily feel like a gimmick but here it does exactly what Jemisin does in The Fifth Season — it makes you complicit. Dara Okafor is a beautifully drawn character, a woman who knows what she's standing on and has to decide what to do with that knowledge. The ending, with her sitting on the floor typing while the earth hums beneath her, brought me to tears. This is what the genre can do when it remembers that science fiction is about people.",
      "date": "2025-09-22",
      "helpfulCount": 47
    },
    {
      "personaId": "sf-003-dmitri",
      "rating": 3,
      "text": "The induced seismicity concept is real — wastewater injection has caused earthquakes in Oklahoma — so points for that. But the story hand-waves the mechanism. Pressurized fluid in boreholes does not work like foundation anchors; you cannot stabilize a fault zone by fracturing it. The displacement sequences are pure fantasy dressed in geological terminology. If you strip away the poetic language about stone remembering, the actual science does not hold up. Still, the prose is good enough that I read to the end.",
      "date": "2026-01-09",
      "helpfulCount": 18
    },
    {
      "personaId": "sf-004-amara",
      "rating": 4,
      "text": "This story understands something essential about Afrofuturist fiction: the future is not a blank slate but a palimpsest, written over but never erased. The conceit of geological knowledge as stolen intellectual property — extracted from enslaved bodies alongside their labor — extends the extractive logic of colonialism into a domain (geology, seismology) that usually escapes that critique. The woman with the iron rod who turns to look directly at Dara across centuries is a powerful moment. I would push back on one thing: the Freedmen's Quarter as setting risks becoming poverty-scenery if the residents beyond Dara remain voiceless, and they do. The community is backdrop, not agent.",
      "date": "2025-11-03",
      "helpfulCount": 52
    },
    {
      "personaId": "sf-005-jin",
      "rating": 4,
      "text": "Structurally interesting — the displacements escalate in duration and depth, each one pulling Dara further into the historical body, until the third one refuses to let go. That refusal is where the story finds its real tension. The conference room scene with Sullivan is almost unbearably well-timed. You want Dara to say the thing, to name what she knows, and instead the earth takes her. The prose runs hot, maybe too hot in places — the ammonite passage is gorgeous but also the point where the metaphor starts to strain. Still, this is a story that takes formal risks and mostly lands them.",
      "date": "2026-02-01",
      "helpfulCount": 12
    },
    {
      "personaId": "sf-006-claire",
      "rating": 3,
      "text": "Real talk: the worldbuilding is strong but the pacing drags in the middle. The second displacement sequence — the tunnel with the tallow candle — goes on too long. We already understand the premise by then. The story is at its best when Dara is in the modern world dealing with institutional inertia: Sullivan dismissing the Freedmen's Quarter, Kemi reading the data, the staff meeting where nobody wants to say the obvious thing. That's where it feels lived-in. The time-travel stuff is compelling but I wanted more of the political thriller underneath it.",
      "date": "2025-10-17",
      "helpfulCount": 8
    },
    {
      "personaId": "sf-007-rowan",
      "rating": 5,
      "text": "Put this in front of every person who says genre fiction can't do the work of literary fiction. The way Dara's body changes between timelines — the calluses, the scars, the muscle memory — is some of the most visceral writing about embodied history I have encountered in SF. And the ending refuses catharsis in the best way: she doesn't confront Sullivan, doesn't publish a takedown, just sits on the floor and starts typing. The revolution is archival. The revolution is remembering. I have already recommended this to three people in my reading group.",
      "date": "2025-08-30",
      "helpfulCount": 29
    },
    {
      "personaId": "sf-008-derek",
      "rating": 4,
      "text": "Came to Butler late and this feels like the best possible combination of her and Jemisin. The second-person works here. Dara is someone I'd want to know — smart, careful, doing her job while the ground literally shifts under her. The displacement scenes hit hard, especially the first one in the elevator. Eight seconds. That detail stuck with me. Could have been tighter in the middle but the ending landed.",
      "date": "2025-12-28",
      "helpfulCount": 6
    },
    {
      "personaId": "sf-009-lena",
      "rating": 3,
      "text": "A technically accomplished piece that demonstrates clear fluency in both source authors. The Butler influence is most visible in the body-as-political-territory motif; the Jemisin influence in the second-person address and the civilizational scale of grief. The Kindred debt is obvious — time displacement, forced inhabitation of an enslaved body — and the story is self-aware about it without being derivative. Where it falters: the geological conceit works better as metaphor than as worldbuilding. The injection well system is described with enough detail to invite scrutiny it cannot survive. The prose occasionally tips from controlled intensity into repetitive insistence. The ammonite scene and the iron rod scene are individually strong but doing the same thematic work twice.",
      "date": "2026-02-11",
      "helpfulCount": 41
    },
    {
      "personaId": "sf-010-kwesi",
      "rating": 3,
      "text": "Solid concept, overwritten execution. The geological compliance bureau is a great invention. The displacement mechanic works. But the prose keeps telling me how to feel about things I already feel — the ammonite passage, the calluses description, the repeated \"your hands / not your hands\" construction. Trust the reader. The Sullivan character is a type, not a person. Rating: 3 because the bones are excellent even where the flesh is excessive.",
      "date": "2025-11-19",
      "helpfulCount": 15
    }
  ]
}
