{
  "workSlug": "the-catalogue-of-burned-things",
  "reviews": [
    {
      "personaId": "goth-001-valentina",
      "rating": 4,
      "text": "This understands something essential about Argentine Gothic: that the haunted house is never just a house, it's the country itself. The diary entries are the structural spine — those shifts from weather reports to cramped, desperate entries about boxes arriving at night trace the exact trajectory of 1976-77, how normalcy and terror coexisted in the same household. The line 'a library is a census of the living' is the kind of formulation that stays. I would have liked more friction between the Zafón lushness and the Enríquez clarity — the prose sometimes settles into one register when the oscillation between beauty and brutality would serve the material better. But the parking garage where the jacaranda grows is an image worthy of either author, and the ending earns its refusal to resolve.",
      "date": "2025-08-14",
      "helpfulCount": 58
    },
    {
      "personaId": "goth-002-owen",
      "rating": 3,
      "text": "Beautifully written but I spent most of it waiting for something to happen that never quite did. The diary entries carry genuine weight, and the grandmother's voice is the strongest thing here. But the books-that-rewrite-themselves conceit feels underdeveloped — it arrives in the final pages like a twist rather than something the story has been building toward. I wanted more dread and less meditation. The Buenos Aires setting is vivid, I'll grant that. The parking garage image is good. But Gothic needs teeth, and this one mostly has atmosphere.",
      "date": "2025-09-02",
      "helpfulCount": 22
    },
    {
      "personaId": "goth-003-sunita",
      "rating": 5,
      "text": "I am still thinking about this one days later. The way the archive becomes a site of haunting — not by ghosts but by the bureaucratic absence of people who were made to not exist — is the most effective use of the Gothic I've read in months. The grandmother's diary entries hit like blows: 'you do not leave people alone in a house that is about to burn.' The detail about Inés's mother keeping no books, the empty shelves as grief — that's Enríquez's brutal clarity doing its work inside Zafón's bookish romanticism. The recursive books felt genuinely eerie to me, not gimmicky. A library cataloguing its own destruction. Devastating.",
      "date": "2025-10-19",
      "helpfulCount": 43
    },
    {
      "personaId": "goth-004-leonard",
      "rating": 3,
      "text": "The architectural uncanny here operates through institutional space rather than domestic — the Biblioteca Nacional as brutalist labyrinth, the archive room as crypt — which is a productive inversion of the Gothic house tradition. The recursive structure (books referencing books that contain the reader reading the books) borrows from Borges more than Zafón, and the piece is honest enough in its Discépolo passage to acknowledge Buenos Aires's labyrinthine self-referentiality directly. Where it falters is in the grandmother's diary, which is too coherent, too artful for a woman writing under threat of annihilation. Real fear does not produce sentences like 'a library is a census of the living.' Real fear produces fragments, erasures, codes. The story romanticizes the archive even as it claims to expose what archives conceal.",
      "date": "2025-11-03",
      "helpfulCount": 37
    },
    {
      "personaId": "goth-005-rachel",
      "rating": 4,
      "text": "The grandmother's diary wrecked me. Bringing this to book club. The mother's unfinished sentence about Vicente is scarier than any ghost.",
      "date": "2025-12-08",
      "helpfulCount": 5
    },
    {
      "personaId": "goth-006-tomasz",
      "rating": 4,
      "text": "An accomplished piece that places itself consciously in the tradition of Borges's 'Library of Babel' and the postdictatorial literature of the Southern Cone. The combination of Zafón's bibliophilic romanticism with Enríquez's political horror works more often than not — the lush descriptions of book smells and foxed pages create a sensory warmth that makes the intrusions of historical violence more effective by contrast. The weakest element is the self-rewriting novel, which pushes the story from the uncanny into the overtly supernatural without the careful groundwork that such a shift requires. The strongest is the visit to Calle Arribeños: the parking garage as palimpsest, the jacaranda seedling growing in concrete darkness. That image carries the weight of the entire political argument without a single declarative sentence.",
      "date": "2025-12-29",
      "helpfulCount": 31
    },
    {
      "personaId": "goth-007-diane",
      "rating": 4,
      "text": "The grandmother's final diary entry destroyed me. 'The books are people, and you do not leave people alone in a house that is about to burn.' I had to put my phone down after that. The story earns its emotion because it never sentimentalizes — the prose stays level and precise even when describing the worst things, which is very Enríquez. The Zafón influence shows in the love of books as physical objects, the weight and smell of them. Together it works: you feel both the tenderness and the terror. The self-rewriting novel at the end was the one moment that felt like it belonged to a different, less grounded story.",
      "date": "2026-01-11",
      "helpfulCount": 19
    },
    {
      "personaId": "goth-008-javier",
      "rating": 2,
      "text": "Too literary for its own good. The Argentine dictatorship deserves better than to be the backdrop for a story about a woman who loves books. The real horror of the disappeared is not that their libraries were burned — it's that they were tortured and thrown from planes. This story flinches from that. It retreats into the comfort of metaphor. Pretty sentences about foxed pages and binding glue while thirty thousand people are missing. The parking garage scene is strong. The rest feels like it's wearing the dictatorship as an aesthetic.",
      "date": "2026-01-24",
      "helpfulCount": 48
    },
    {
      "personaId": "goth-009-grace",
      "rating": 4,
      "text": "Speaking as someone who has spent decades in an archive: the procedural details are right. The accession numbers, the provenance records, the way an uncatalogued donation sits in storage for years because nobody wants to deal with the paperwork. The narrator's loneliness-as-professional-aptitude rings painfully true. Where the story lost me slightly was the supernatural turn — the books rearranging themselves on shelves, the text changing between readings. The grounded horror of the diary entries and the names in the margins is more powerful than any magical conceit. But the grandmother's separate ledger, the names written into endpapers as a form of resistance against erasure — that is both archivally plausible and deeply moving. The best archival horror I have read since The Historian.",
      "date": "2026-02-02",
      "helpfulCount": 34
    },
    {
      "personaId": "goth-010-felix",
      "rating": 4,
      "text": "Picked this up because of the Zafón influence and it delivers on the bookish mystery — the uncatalogued donation, the grandmother's diary, the recursive novels. Buenos Aires feels like Barcelona's dark mirror here. The pacing is slow but earned, and the reveal about the books belonging to the disappeared lands hard. The ending where the text rewrites itself to include the narrator is genuinely creepy. I wanted just a bit more resolution — does she tell anyone? Does she confront her mother with the diary? — but I understand that the lack of resolution is the point.",
      "date": "2026-02-09",
      "helpfulCount": 8
    },
    {
      "personaId": "goth-004-leonard",
      "rating": 4,
      "text": "Returning to this after a re-read, and I want to revise upward. What I initially read as romanticizing the archive now reads as something more deliberate: the narrator inherits her grandmother's bibliophilia as a coping mechanism, and the lush descriptions of book-as-object are themselves a form of avoidance — she catalogues the physical properties because confronting the human ones is unbearable. The grandmother's diary is too polished, I still maintain that, but the contrast between Amelia's eloquence and the brutal simplicity of what she is describing (hiding evidence of existence from a state determined to erase it) produces a productive tension rather than a flaw. The Discépolo passage — the city rearranging itself like a sentence being revised — is the story's quiet thesis about how narrative and geography conspire to make disappearance possible.",
      "date": "2026-02-18",
      "helpfulCount": 52
    }
  ]
}
