{
  "workSlug": "burn-protocols-for-a-cooling-world",
  "reviews": [
    {
      "personaId": "dys-001-natalie",
      "rating": 4,
      "text": "The bureaucratic scaffolding here is devastating in exactly the right way. The intake form flagging a child's books as 'nonessential materials — flag for Thermal Reclamation' does more political work than most novels manage in three hundred pages. Sandra's line — 'knowing and doing are different countries, and there's no road between them that doesn't cost someone money' — should be carved into the wall of every climate summit. What impresses me most is how the story refuses to make the villains monstrous. Diane Whitfield stands at the edge of the cellar with 'administrative regret,' and that phrase alone indicts an entire class of people who process atrocity through compliance. The congressional testimony framing is smart, grounding the horror in institutional language that any human rights practitioner will recognize as the dialect of complicity.",
      "date": "2025-11-18",
      "helpfulCount": 64
    },
    {
      "personaId": "dys-002-tomasz",
      "rating": 3,
      "text": "Structurally competent — the interleaving of congressional testimony, bureaucratic memoranda, and narrative is well-executed and maintains tension. The internal memo instructing administrators to 'not permit alternative framings to gain traction' is a fine piece of totalitarian grammar. But the story relies too heavily on its central metaphor being immediately legible. Fire-as-censorship is not a discovery here; it is a premise delivered in the title and never complicated. I wanted the story to betray its own thesis somewhere — to show us a moment where the burning actually was just about fuel, to make the reader uncertain. Instead we get confirmation at every turn. The child-as-archive conceit is emotionally effective but intellectually safe.",
      "date": "2025-09-03",
      "helpfulCount": 33
    },
    {
      "personaId": "dys-003-amira",
      "rating": 4,
      "text": "The most interesting thing this story does is frame preservation as gendered labor. Sandra is a librarian — her instinct to catalog, to organize, to hide books inside a quilt — and Anita Reade, a teacher reassigned to water distribution, are the ones who build the archive. The men in this story carry clipboards and make policy. The women carry boxes across scrubland at night. I appreciate that the narrative doesn't romanticize this as empowerment; it's presented as another form of unpaid, unrecognized work that women do to hold civilization together while men sign protocols that dismantle it. Willa learning that 'being right and being powerless are the same thing' hits differently when you notice it's a lesson exclusively taught to her by women who already knew.",
      "date": "2026-01-07",
      "helpfulCount": 57
    },
    {
      "personaId": "dys-004-derek",
      "rating": 5,
      "text": "That line about the pages being more legible the instant before the fire takes them — I had to set my phone down after that. Thirty years around fire and I've never seen anyone get that detail right. The whole thing stayed with me for days. Willa writing on the backs of ration cards at the end, alone in her container, just refusing to let the knowing disappear. That's real courage. Not the loud kind. The stubborn kind.",
      "date": "2025-08-11",
      "helpfulCount": 19
    },
    {
      "personaId": "dys-005-juno",
      "rating": 4,
      "text": "As a librarian I am probably too close to this one to be objective, but Sandra saying 'you can take the building away and fire the staff and cut the budget to zero, but the instinct to preserve doesn't go away because someone signs a protocol' made me cry at my desk. The story is at its best in the withheld moments — Sandra's face doing 'something quieter and more dangerous' than crying when she reads the USGS page, Anita's recognition of Willa as something other than a child. What the narrative never says outright is that Sandra sent her daughter to the cellar knowing what the consequences would be. That silence does a lot of work. Anita's 'emotional taxonomy' shelving method — filing a novel about a road trip next to an aquifer map — is the kind of detail that makes me trust a writer completely.",
      "date": "2025-12-22",
      "helpfulCount": 43
    },
    {
      "personaId": "dys-006-raj",
      "rating": 4,
      "text": "The structural logic here is clean and effective. Alternating between Willa's narrative and the documentary scaffolding — congressional testimony, intake forms, internal memos — gives the story a dual engine that keeps it moving without wasted motion. The Bureau's clipboard-and-coveralls bureaucracy is well-drawn. Where it loses a half step: the ending with the congressional addendum wraps things up too neatly for a system this entrenched. But the architecture holds, and the line about knowing and doing being \"different countries\" earns its place.",
      "date": "2025-10-14",
      "helpfulCount": 15
    },
    {
      "personaId": "dys-007-elena",
      "rating": 3,
      "text": "The political mechanics are sharper than most climate fiction manages. \"Do not permit alternative framings to gain traction\" — that memo reads like something from a Romanian state archive. The story understands that censorship never calls itself censorship; it calls itself efficiency. Good. But the congressional hearing framing lets the system off too easily. In my experience, the hearing happens and nothing changes. Sandra Boone is the most credible character — a librarian who catalogs rations because cataloging is breathing. Willa edges toward symbol rather than person by the final pages.",
      "date": "2025-08-22",
      "helpfulCount": 36
    },
    {
      "personaId": "dys-008-felix",
      "rating": 4,
      "text": "This is doing something genuinely interesting with its source material. The Bradbury inheritance isn't just thematic — it's tonal. Those lyrical memory passages about sprinklers and wet grass operate as sensory resistance against El Akkad's bureaucratic flattening, and the tension between those registers is where the story lives. The documentary scaffolding works beautifully; the intake form flagging Willa's books for future burning is quietly devastating. Anita's line about the globe — \"They're going to burn the whole world. A little paper one, but still\" — lands because it's understated. My reservation is that the Fahrenheit 451 parallels occasionally feel too legible, closing down interpretive space rather than opening it.",
      "date": "2026-01-09",
      "helpfulCount": 48
    },
    {
      "personaId": "dys-009-cora",
      "rating": 5,
      "text": "The physical details carry this. Sandra packing bags the night the water compact collapsed, not crying because \"crying and arguing both required water the body could not spare.\" That's not metaphor — that's physiology under scarcity. And Willa remembering the weight of water on grass blades, the pages going soft as cloth from rereading. The story knows that losing a world means losing what your body knew about it. Properly affecting.",
      "date": "2025-12-03",
      "helpfulCount": 24
    },
    {
      "personaId": "dys-010-owen",
      "rating": 4,
      "text": "The institutional voice work is the real achievement. Every document is pitch-perfect in register, and each performs a different function in the story's argument about how bureaucratic language enables destruction. The intake form flagging thirty pounds of books as potential fuel is institutional language converting human meaning into administrative category. \"Everything else is fuel\" could be the epigraph for the whole piece. The intertextual relationship with Fahrenheit 451 is handled with more sophistication than expected — Willa reading about the woman who burns with her books works as both allusion and plot mechanism. My complaint: the congressional testimony implies accountability arrived. That's the most fantastical element in a climate dystopia.",
      "date": "2025-09-17",
      "helpfulCount": 41
    }
  ]
}