{
  "workSlug": "the-extra-step",
  "reviews": [
    {
      "personaId": "horror-001-elena",
      "rating": 4,
      "helpfulCount": 72,
      "text": "You can feel the Jackson influence in every sentence that is technically correct but somehow wrong — the way the narrator describes the hallway bend as 'not ninety degrees' without ever saying what it is instead. That restraint is pure Hill House. And the Buenos Aires details are not decoration: the three hundred thousand pesos, the colectivo, Doña Carmen's television as the building's ambient nervous system. The Enriquez comes through in how the horror is inseparable from the economics — this woman stays because the rent is cheap, and that is as terrifying as the seventeenth step. The Lucía scene about books that damage themselves is the story's quiet thesis, and it earns its weight. My only reservation is the unnumbered door episode, which felt slightly too overt for a story that otherwise trusts implication. But that final image of the airshaft — afraid of how long it would take to hear something land — is devastating.",
      "date": "2026-02-21"
    },
    {
      "personaId": "horror-002-travis",
      "rating": 2,
      "helpfulCount": 31,
      "text": "I kept waiting for something to actually happen and it never did. A lady counts some stairs. A cat acts weird. An old woman dies, which is sad I guess but not scary. The hallway angles don't add up? Okay, call a contractor. I get that this is supposed to be the 'literary' kind of horror but at some point horror has to be horrifying, and a slightly tilted kitchen counter just doesn't get there for me. The writing is fine, I'll give it that. The bit about the tooth in a diseased jaw was good. But 4,000 words of a woman measuring a hallway is not my idea of a horror story.",
      "date": "2026-02-22"
    },
    {
      "personaId": "horror-003-suki",
      "rating": 4,
      "helpfulCount": 85,
      "text": "This operates in the Aickman register — the horror of spaces that resist rational description. The tape measure reading six meters forty twice while the experience contradicts the measurement is the story's most unsettling move, and it works because the narrator is a cataloger, a woman whose entire profession depends on the ability to name what is wrong. The building defeats that ability. It defeats measurement itself. The structural echo between the book that damages itself and the building that is wrong rather than damaged is precise and earns the comparison without overplaying it. Where the story falters slightly is in the Doña Carmen thread — her death feels more functional than earned, a plot mechanism to reveal that all staircases now have seventeen steps. But the ending, the narrator choosing to stay and count because counting is 'the only thing I have,' is quietly devastating. This is horror as epistemological crisis, and it largely succeeds.",
      "date": "2026-02-22"
    },
    {
      "personaId": "horror-004-declan",
      "rating": 3,
      "helpfulCount": 64,
      "text": "A competent piece that knows its tradition — the Hill House bloodline is visible in the architecture-as-antagonist, and the narrator's slow erosion of certainty follows the Jacksonian playbook with reasonable fidelity. The Buenos Aires setting provides genuine freshness; I have read a lifetime of English country houses and New England colonials, and the San Telmo apartment block with its tilted floors and crumbling Italianate facades was a welcome change of geography. The prose is controlled. The step-counting motif accumulates weight. But the story announces its themes too explicitly in places — the cataloger-of-damage metaphor is stated, then restated, then applied directly to the building, and I would have preferred to make that connection myself. M.R. James trusted the reader to do the work. This narrator, for all her precision, does not quite trust us enough.",
      "date": "2026-02-23"
    },
    {
      "personaId": "horror-005-amara",
      "rating": 5,
      "helpfulCount": 78,
      "text": "This is the horror story I have been waiting for someone to write — the one where the haunted house and the housing crisis are the same thing. The narrator stays because three hundred thousand pesos will not buy her anything better, and that economic fact is as structurally load-bearing as the seventeenth step. The line about how 'no one is coming to fix it and no one is coming to measure it and no one is coming to tell you that the place where you live does not conform to the rules that govern the places where other people live' is not just about a building. It is about every forgotten neighborhood in every city where infrastructure failure has been normalized into invisibility. The Enriquez influence is real and well-deployed — this is horror that knows the building code inspector is scarier than any ghost. And the ending, where the narrator clings to counting as her last defense against absorption, broke me.",
      "date": "2026-02-20"
    },
    {
      "personaId": "horror-006-jordan",
      "rating": 5,
      "helpfulCount": 45,
      "text": "Read this in one sitting at the shop after closing and had to sit with the lights on for a while afterward. The genius of this story is that it never gives you a monster or a ghost or even a definitive supernatural event — just measurements that don't match experience, steps that shouldn't exist, a hallway that takes longer to walk than it should. The cat pacing in circuits and pausing at the wall was the detail that got under my skin the most. Animals know. The social dimension lifts this above standard haunted-house fare: the neighbors who skip the extra step because their bodies have adapted to wrongness the way bodies adapt to poverty. Graciela saying 'Buildings settle, everything settles' is the scariest line I have read this year. Absolutely recommending this at next month's book club.",
      "date": "2026-02-21"
    },
    {
      "personaId": "horror-007-paolo",
      "rating": 4,
      "helpfulCount": 69,
      "text": "As someone who studies the phenomenology of architectural space, this story gets something fundamentally right: the horror is not in the building's appearance but in the discrepancy between its measured dimensions and its experienced dimensions. Six meters forty in both directions, yet one half takes longer to traverse. This is Merleau-Ponty's lived body encountering non-Euclidean domestic space, and the story knows it without ever becoming theoretical. The narrator's profession — cataloging damage, naming what is broken — makes her the ideal consciousness through which to register a building whose wrongness resists categorization. The Lucía passage about self-damaging books is the structural keystone, and it holds. I would have liked more architectural specificity in places — what does the hallway smell like, how does the light fall differently after the bend — but the spatial unease is genuine and well-sustained.",
      "date": "2026-02-23"
    },
    {
      "personaId": "horror-008-linda",
      "rating": 4,
      "helpfulCount": 37,
      "text": "Thirty years of horror novels and it is still the quiet ones that get me. The airshaft at the end — 'I have never dropped anything into it because I am afraid of how long it would take to hear it land' — gave me actual chills, which does not happen often anymore. The cat was beautifully done. The way Bicho's pacing mirrors the building's breathing at the end is the kind of detail that stays with you. Doña Carmen dying with the television on after thirty-one years in that place was heartbreaking more than horrifying, and I think that is the point. The narrator is watching her own future. Not a single cheap scare, just that slow accumulation of wrongness that good quiet horror does better than anything.",
      "date": "2026-02-24"
    },
    {
      "personaId": "horror-009-rafael",
      "rating": 3,
      "helpfulCount": 58,
      "text": "The Buenos Aires is mostly right — San Telmo south of San Juan, the colectivo, the ferretería on Defensa, the cortados, the feria at Plaza Dorrego. The economic details ring true: three hundred thousand pesos for a two-room apartment in a building that should be condemned, the part-time library work that pays 'almost enough.' Enriquez's fingerprints are visible. But this reads to me like Jackson wearing an Argentine mask rather than a genuine fusion. The narrator's voice is too controlled, too Anglo in its precision — Enriquez's narrators have a rawness, a matter-of-factness about violence and poverty that this story gestures toward but never fully commits to. The building collapses in Constitución are mentioned but kept at a safe distance. A real Enriquez story would have put the narrator inside one. Still, the hallway-that-measures-correctly-but-feels-wrong is a strong conceit, and the ending earns its refusal to resolve.",
      "date": "2026-02-25"
    },
    {
      "personaId": "horror-010-meredith",
      "rating": 5,
      "helpfulCount": 82,
      "text": "This is architectural gaslighting — a building that insists, through measurement, that it conforms to the rules while the narrator's body tells her it does not. The feminist dimension is subtle but essential: a woman whose ex-husband lied about antihistamines for seven years, revealing 'the architecture of all the other lies,' now lives inside a structure whose dishonesty she cannot prove. The Jackson lineage is in every sentence — prose that is perfectly grammatical yet somehow wrong. But the Enriquez contribution is equally vital: the horror is systemic, not supernatural. The building is what happens when a city stops caring about the people who live in its cheapest rooms. The ending — staying because leaving would mean admitting the building is what she thinks it is, and she has no word for it — is Jackson's Eleanor refracted through Enriquez's Buenos Aires. Devastating.",
      "date": "2026-02-20"
    }
  ]
}
